betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_adc.h
/* Mask containing trigger edge masks for each of possible                    */
/* trigger edge selection duplicated with shifts [0; 4; 8; 12]                */
/* corresponding to {SW start; ext trigger; ext trigger; ext trigger}.        */
#define ADC_REG_TRIG_EDGE_MASK              (((DDL_ADC_REG_TRIG_SOFTWARE & ADC_CTRL2_REGEXTTRGEN) >> (4UL * 0UL)) | \
                                             ((ADC_REG_TRIG_EXT_EDGE_DEFAULT)            >> (4UL * 1UL)) | \
                                             ((ADC_REG_TRIG_EXT_EDGE_DEFAULT)            >> (4UL * 2UL)) | \
                                             ((ADC_REG_TRIG_EXT_EDGE_DEFAULT)            >> (4UL * 3UL)))

/* Definition of ADC group regular trigger bits information.                  */
#define ADC_REG_TRIG_EXTSEL_BITOFFSET_POS  (24UL) /* Value equivalent to POSITION_VAL(ADC_CTRL2_REGEXTTRGSEL) */
#define ADC_REG_TRIG_EXTEN_BITOFFSET_POS   (28UL) /* Value equivalent to POSITION_VAL(ADC_CTRL2_REGEXTTRGEN) */



/* Internal mask for ADC group injected trigger:                              */
/* To select into literal DDL_ADC_INJ_TRIG_x the relevant bits for:           */
/* - injected trigger source                                                  */
/* - injected trigger edge                                                    */
#define ADC_INJ_TRIG_EXT_EDGE_DEFAULT      (ADC_CTRL2_INJEXTTRGEN_0) /* Trigger edge set to rising edge (default setting for compatibility with some ADC on other APM32 families having this setting set by HW default value) */

/* Mask containing trigger source masks for each of possible                  */
/* trigger edge selection duplicated with shifts [0; 4; 8; 12]                */
/* corresponding to {SW start; ext trigger; ext trigger; ext trigger}.        */
#define ADC_INJ_TRIG_SOURCE_MASK            (((DDL_ADC_REG_TRIG_SOFTWARE & ADC_CTRL2_INJGEXTTRGSEL) >> (4UL * 0UL)) | \
                                             ((ADC_CTRL2_INJGEXTTRGSEL)                            >> (4UL * 1UL)) | \
                                             ((ADC_CTRL2_INJGEXTTRGSEL)                            >> (4UL * 2UL)) | \
                                             ((ADC_CTRL2_INJGEXTTRGSEL)                            >> (4UL * 3UL)))

/* Mask containing trigger edge masks for each of possible                    */
/* trigger edge selection duplicated with shifts [0; 4; 8; 12]                */
/* corresponding to {SW start; ext trigger; ext trigger; ext trigger}.        */
#define ADC_INJ_TRIG_EDGE_MASK              (((DDL_ADC_INJ_TRIG_SOFTWARE & ADC_CTRL2_INJEXTTRGEN) >> (4UL * 0UL)) | \
                                             ((ADC_INJ_TRIG_EXT_EDGE_DEFAULT)             >> (4UL * 1UL)) | \
                                             ((ADC_INJ_TRIG_EXT_EDGE_DEFAULT)             >> (4UL * 2UL)) | \
                                             ((ADC_INJ_TRIG_EXT_EDGE_DEFAULT)             >> (4UL * 3UL)))

/* Definition of ADC group injected trigger bits information.                 */
#define ADC_INJ_TRIG_EXTSEL_BITOFFSET_POS  (16UL) /* Value equivalent to POSITION_VAL(ADC_CTRL2_INJGEXTTRGSEL) */
#define ADC_INJ_TRIG_EXTEN_BITOFFSET_POS   (20UL) /* Value equivalent to POSITION_VAL(ADC_CTRL2_INJEXTTRGEN) */

/* Internal mask for ADC channel:                                             */
/* To select into literal DDL_ADC_CHANNEL_x the relevant bits for:            */
/* - channel identifier defined by number                                     */
/* - channel differentiation between external channels (connected to          */
/*   GPIO pins) and internal channels (connected to internal paths)           */
/* - channel sampling time defined by SMPRx register offset                   */
/*   and SMPx bits positions into SMPRx register                              */
#define ADC_CHANNEL_ID_NUMBER_MASK         (ADC_CTRL1_AWDCHSEL)
#define ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS ( 0UL)/* Value equivalent to POSITION_VAL(ADC_CHANNEL_ID_NUMBER_MASK) */
#define ADC_CHANNEL_ID_MASK                (ADC_CHANNEL_ID_NUMBER_MASK | ADC_CHANNEL_ID_INTERNAL_CH_MASK)
/* Equivalent mask of ADC_CHANNEL_NUMBER_MASK aligned on register LSB (bit 0) */
#define ADC_CHANNEL_ID_NUMBER_MASK_POSBIT0 0x0000001FU /* Equivalent to shift: (ADC_CHANNEL_NUMBER_MASK >> POSITION_VAL(ADC_CHANNEL_NUMBER_MASK)) */

/* Channel differentiation between external and internal channels */
#define ADC_CHANNEL_ID_INTERNAL_CH         0x80000000UL   /* Marker of internal channel */
#define ADC_CHANNEL_ID_INTERNAL_CH_2       0x40000000UL   /* Marker of internal channel for other ADC instances, in case of different ADC internal channels mapped on same channel number on different ADC instances */
#define ADC_CHANNEL_DIFFERENCIATION_TEMPSENSOR_VBAT 0x10000000U  /* Dummy bit for driver internal usage, not used in ADC channel setting registers CR1 or SQRx */
#define ADC_CHANNEL_ID_INTERNAL_CH_MASK    (ADC_CHANNEL_ID_INTERNAL_CH | ADC_CHANNEL_ID_INTERNAL_CH_2 | ADC_CHANNEL_DIFFERENCIATION_TEMPSENSOR_VBAT)

/* Internal register offset for ADC channel sampling time configuration */
/* (offset placed into a spare area of literal definition) */
#define ADC_SMPTIM1_REGOFFSET                0x00000000UL
#define ADC_SMPTIM2_REGOFFSET                0x02000000UL
#define ADC_CHANNEL_SMPRX_REGOFFSET_MASK   (ADC_SMPTIM1_REGOFFSET | ADC_SMPTIM2_REGOFFSET)

#define ADC_CHANNEL_SMPx_BITOFFSET_MASK    0x01F00000UL
#define ADC_CHANNEL_SMPx_BITOFFSET_POS     (20UL)           /* Value equivalent to POSITION_VAL(ADC_CHANNEL_SMPx_BITOFFSET_MASK) */

/* Definition of channels ID number information to be inserted into           */
/* channels literals definition.                                              */
#define ADC_CHANNEL_0_NUMBER               0x00000000UL
#define ADC_CHANNEL_1_NUMBER               (                                                                        ADC_CTRL1_AWDCHSEL_0)
#define ADC_CHANNEL_2_NUMBER               (                                                      ADC_CTRL1_AWDCHSEL_1                  )
#define ADC_CHANNEL_3_NUMBER               (                                                      ADC_CTRL1_AWDCHSEL_1 | ADC_CTRL1_AWDCHSEL_0)
#define ADC_CHANNEL_4_NUMBER               (                                    ADC_CTRL1_AWDCHSEL_2                                    )
#define ADC_CHANNEL_5_NUMBER               (                                    ADC_CTRL1_AWDCHSEL_2                   | ADC_CTRL1_AWDCHSEL_0)
#define ADC_CHANNEL_6_NUMBER               (                                    ADC_CTRL1_AWDCHSEL_2 | ADC_CTRL1_AWDCHSEL_1                  )
#define ADC_CHANNEL_7_NUMBER               (                                    ADC_CTRL1_AWDCHSEL_2 | ADC_CTRL1_AWDCHSEL_1 | ADC_CTRL1_AWDCHSEL_0)
#define ADC_CHANNEL_8_NUMBER               (                  ADC_CTRL1_AWDCHSEL_3                                                      )
#define ADC_CHANNEL_9_NUMBER               (                  ADC_CTRL1_AWDCHSEL_3                                     | ADC_CTRL1_AWDCHSEL_0)
#define ADC_CHANNEL_10_NUMBER              (                  ADC_CTRL1_AWDCHSEL_3                   | ADC_CTRL1_AWDCHSEL_1                  )
#define ADC_CHANNEL_11_NUMBER              (                  ADC_CTRL1_AWDCHSEL_3                   | ADC_CTRL1_AWDCHSEL_1 | ADC_CTRL1_AWDCHSEL_0)
#define ADC_CHANNEL_12_NUMBER              (                  ADC_CTRL1_AWDCHSEL_3 | ADC_CTRL1_AWDCHSEL_2                                    )
#define ADC_CHANNEL_13_NUMBER              (                  ADC_CTRL1_AWDCHSEL_3 | ADC_CTRL1_AWDCHSEL_2                   | ADC_CTRL1_AWDCHSEL_0)
#define ADC_CHANNEL_14_NUMBER              (                  ADC_CTRL1_AWDCHSEL_3 | ADC_CTRL1_AWDCHSEL_2 | ADC_CTRL1_AWDCHSEL_1                  )
#define ADC_CHANNEL_15_NUMBER              (                  ADC_CTRL1_AWDCHSEL_3 | ADC_CTRL1_AWDCHSEL_2 | ADC_CTRL1_AWDCHSEL_1 | ADC_CTRL1_AWDCHSEL_0)
#define ADC_CHANNEL_16_NUMBER              (ADC_CTRL1_AWDCHSEL_4                                                                        )
#define ADC_CHANNEL_17_NUMBER              (ADC_CTRL1_AWDCHSEL_4                                                       | ADC_CTRL1_AWDCHSEL_0)
#define ADC_CHANNEL_18_NUMBER              (ADC_CTRL1_AWDCHSEL_4                                     | ADC_CTRL1_AWDCHSEL_1                  )

