betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_adc.h
  uint32_t SequencerLength;             /*!< Set ADC group regular sequencer length.
                                             This parameter can be a value of @ref ADC_DDL_EC_REG_SEQ_SCAN_LENGTH
                                             @note This parameter is discarded if scan mode is disabled (refer to parameter 'ADC_SequencersScanMode').

                                             This feature can be modified afterwards using unitary function @ref DDL_ADC_REG_SetSequencerLength(). */

  uint32_t SequencerDiscont;            /*!< Set ADC group regular sequencer discontinuous mode: sequence subdivided and scan conversions interrupted every selected number of ranks.
                                             This parameter can be a value of @ref ADC_DDL_EC_REG_SEQ_DISCONT_MODE
                                             @note This parameter has an effect only if group regular sequencer is enabled
                                                   (scan length of 2 ranks or more).

                                             This feature can be modified afterwards using unitary function @ref DDL_ADC_REG_SetSequencerDiscont(). */

  uint32_t ContinuousMode;              /*!< Set ADC continuous conversion mode on ADC group regular, whether ADC conversions are performed in single mode (one conversion per trigger) or in continuous mode (after the first trigger, following conversions launched successively automatically).
                                             This parameter can be a value of @ref ADC_DDL_EC_REG_CONTINUOUS_MODE
                                             Note: It is not possible to enable both ADC group regular continuous mode and discontinuous mode.

                                             This feature can be modified afterwards using unitary function @ref DDL_ADC_REG_SetContinuousMode(). */

  uint32_t DMATransfer;                 /*!< Set ADC group regular conversion data transfer: no transfer or transfer by DMA, and DMA requests mode.
                                             This parameter can be a value of @ref ADC_DDL_EC_REG_DMA_TRANSFER

                                             This feature can be modified afterwards using unitary function @ref DDL_ADC_REG_SetDMATransfer(). */

} DDL_ADC_REG_InitTypeDef;

/**
  * @brief  Structure definition of some features of ADC group injected.
  * @note   These parameters have an impact on ADC scope: ADC group injected.
  *         Refer to corresponding unitary functions into
  *         @ref ADC_DDL_EF_Configuration_ADC_Group_Regular
  *         (functions with prefix "INJ").
  * @note   The setting of these parameters by function @ref DDL_ADC_INJ_Init()
  *         is conditioned to ADC state:
  *         ADC instance must be disabled.
  *         This condition is applied to all ADC features, for efficiency
  *         and compatibility over all APM32 families. However, the different
  *         features can be set under different ADC state conditions
  *         (setting possible with ADC enabled without conversion on going,
  *         ADC enabled with conversion on going, ...)
  *         Each feature can be updated afterwards with a unitary function
  *         and potentially with ADC in a different state than disabled,
  *         refer to description of each function for setting
  *         conditioned to ADC state.
  */
typedef struct
{
  uint32_t TriggerSource;               /*!< Set ADC group injected conversion trigger source: internal (SW start) or from external IP (timer event, external interrupt line).
                                             This parameter can be a value of @ref ADC_DDL_EC_INJ_TRIGGER_SOURCE
                                             @note On this APM32 series, setting of external trigger edge is performed
                                                   using function @ref DDL_ADC_INJ_StartConversionExtTrig().

                                             This feature can be modified afterwards using unitary function @ref DDL_ADC_INJ_SetTriggerSource(). */

  uint32_t SequencerLength;             /*!< Set ADC group injected sequencer length.
                                             This parameter can be a value of @ref ADC_DDL_EC_INJ_SEQ_SCAN_LENGTH
                                             @note This parameter is discarded if scan mode is disabled (refer to parameter 'ADC_SequencersScanMode').

                                             This feature can be modified afterwards using unitary function @ref DDL_ADC_INJ_SetSequencerLength(). */

  uint32_t SequencerDiscont;            /*!< Set ADC group injected sequencer discontinuous mode: sequence subdivided and scan conversions interrupted every selected number of ranks.
                                             This parameter can be a value of @ref ADC_DDL_EC_INJ_SEQ_DISCONT_MODE
                                             @note This parameter has an effect only if group injected sequencer is enabled
                                                   (scan length of 2 ranks or more).

                                             This feature can be modified afterwards using unitary function @ref DDL_ADC_INJ_SetSequencerDiscont(). */

  uint32_t TrigAuto;                    /*!< Set ADC group injected conversion trigger: independent or from ADC group regular.
                                             This parameter can be a value of @ref ADC_DDL_EC_INJ_TRIG_AUTO
                                             Note: This parameter must be set to set to independent trigger if injected trigger source is set to an external trigger.

                                             This feature can be modified afterwards using unitary function @ref DDL_ADC_INJ_SetTrigAuto(). */

} DDL_ADC_INJ_InitTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup ADC_DDL_Exported_Constants ADC Exported Constants
  * @{
  */

/** @defgroup ADC_DDL_EC_FLAG ADC flags
  * @brief    Flags defines which can be used with DDL_ADC_ReadReg function
  * @{
  */
#define DDL_ADC_FLAG_STRT                   ADC_STS_REGCSFLG       /*!< ADC flag ADC group regular conversion start */
#define DDL_ADC_FLAG_EOCS                   ADC_STS_EOCFLG         /*!< ADC flag ADC group regular end of unitary conversion or sequence conversions (to configure flag of end of conversion, use function @ref DDL_ADC_REG_SetFlagEndOfConversion() ) */
#define DDL_ADC_FLAG_EOS                    ADC_STS_EOCFLG         /*!< ADC flag ADC group regular end of sequence conversions (Note: on this APM32 serie, there is no flag ADC group regular end of unitary conversion. Flag noted as "EOC" is corresponding to flag "EOS" in other APM32 families) */
#if defined (ADC_STS_OVRFLG)
#define DDL_ADC_FLAG_OVR                    ADC_STS_OVRFLG         /*!< ADC flag ADC group regular overrun */
#endif /* ADC_STS_OVRFLG */
#define DDL_ADC_FLAG_JSTRT                  ADC_STS_INJCSFLG       /*!< ADC flag ADC group injected conversion start */
#define DDL_ADC_FLAG_JEOS                   ADC_STS_INJEOCFLG        /*!< ADC flag ADC group injected end of sequence conversions (Note: on this APM32 series, there is no flag ADC group injected end of unitary conversion. Flag noted as "JEOC" is corresponding to flag "JEOS" in other APM32 families) */
#define DDL_ADC_FLAG_AWD1                   ADC_STS_AWDFLG         /*!< ADC flag ADC analog watchdog 1 */
#if defined(ADC_MULTIMODE_SUPPORT)
#if defined (ADC_CSTS_EOCFLG1)
#define DDL_ADC_FLAG_EOCS_MST               ADC_CSTS_EOCFLG1       /*!< ADC flag ADC multimode master group regular end of unitary conversion or sequence conversions (to configure flag of end of conversion, use function @ref DDL_ADC_REG_SetFlagEndOfConversion() ) */
#define DDL_ADC_FLAG_EOCS_SLV1              ADC_CSTS_EOCFLG2       /*!< ADC flag ADC multimode slave 1 group regular end of unitary conversion or sequence conversions (to configure flag of end of conversion, use function @ref DDL_ADC_REG_SetFlagEndOfConversion() ) */
#define DDL_ADC_FLAG_EOCS_SLV2              ADC_CSTS_EOCFLG3       /*!< ADC flag ADC multimode slave 2 group regular end of unitary conversion or sequence conversions (to configure flag of end of conversion, use function @ref DDL_ADC_REG_SetFlagEndOfConversion() ) */
#define DDL_ADC_FLAG_OVR_MST                ADC_CSTS_OVRFLG1       /*!< ADC flag ADC multimode master group regular overrun */
#define DDL_ADC_FLAG_OVR_SLV1               ADC_CSTS_OVRFLG2       /*!< ADC flag ADC multimode slave 1 group regular overrun */
#define DDL_ADC_FLAG_OVR_SLV2               ADC_CSTS_OVRFLG3       /*!< ADC flag ADC multimode slave 2 group regular overrun */
#define DDL_ADC_FLAG_JEOS_MST               ADC_CSTS_INJEOCFLG1    /*!< ADC flag ADC multimode master group injected end of sequence conversions (Note: on this APM32 series, there is no flag ADC group injected end of unitary conversion. Flag noted as "JEOC" is corresponding to flag "JEOS" in other APM32 families) */
#define DDL_ADC_FLAG_JEOS_SLV1              ADC_CSTS_INJEOCFLG2    /*!< ADC flag ADC multimode slave 1 group injected end of sequence conversions (Note: on this APM32 series, there is no flag ADC group injected end of unitary conversion. Flag noted as "JEOC" is corresponding to flag "JEOS" in other APM32 families) */
#define DDL_ADC_FLAG_JEOS_SLV2              ADC_CSTS_INJEOCFLG3    /*!< ADC flag ADC multimode slave 2 group injected end of sequence conversions (Note: on this APM32 series, there is no flag ADC group injected end of unitary conversion. Flag noted as "JEOC" is corresponding to flag "JEOS" in other APM32 families) */
#define DDL_ADC_FLAG_AWD1_MST               ADC_CSTS_AWDFLG1       /*!< ADC flag ADC multimode master analog watchdog 1 of the ADC master */
#define DDL_ADC_FLAG_AWD1_SLV1              ADC_CSTS_AWDFLG2       /*!< ADC flag ADC multimode slave 1 analog watchdog 1 */
#define DDL_ADC_FLAG_AWD1_SLV2              ADC_CSTS_AWDFLG3       /*!< ADC flag ADC multimode slave 2 analog watchdog 1 */
#else
#define DDL_ADC_FLAG_EOS_MST                ADC_STS_EOCFLG         /*!< ADC flag ADC multimode master group regular end of sequence conversions (Note: on this STM32 serie, there is no flag ADC group regular end of unitary conversion. Flag noted as "EOC" is corresponding to flag "EOS" in other STM32 families) */
#define DDL_ADC_FLAG_EOS_SLV                ADC_STS_EOCFLG         /*!< ADC flag ADC multimode slave group regular end of sequence conversions (Note: on this STM32 serie, there is no flag ADC group regular end of unitary conversion. Flag noted as "EOC" is corresponding to flag "EOS" in other STM32 families) (on STM32F1, this flag must be read from ADC instance slave: ADC2) */
#define DDL_ADC_FLAG_JEOS_MST               ADC_STS_INJEOCFLG      /*!< ADC flag ADC multimode master group injected end of sequence conversions (Note: on this STM32 serie, there is no flag ADC group injected end of unitary conversion. Flag noted as "JEOC" is corresponding to flag "JEOS" in other STM32 families) */
#define DDL_ADC_FLAG_JEOS_SLV               ADC_STS_INJEOCFLG      /*!< ADC flag ADC multimode slave group injected end of sequence conversions (Note: on this STM32 serie, there is no flag ADC group injected end of unitary conversion. Flag noted as "JEOC" is corresponding to flag "JEOS" in other STM32 families) (on STM32F1, this flag must be read from ADC instance slave: ADC2) */
#define DDL_ADC_FLAG_AWD1_MST               ADC_STS_AWDFLG         /*!< ADC flag ADC multimode master analog watchdog 1 of the ADC master */
#define DDL_ADC_FLAG_AWD1_SLV               ADC_STS_AWDFLG         /*!< ADC flag ADC multimode slave analog watchdog 1 of the ADC slave (on STM32F1, this flag must be read from ADC instance slave: ADC2) */
#endif /* ADC_CSTS_EOCFLG1 */
#endif /* ADC_MULTIMODE_SUPPORT */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_IT ADC interruptions for configuration (interruption enable or disable)
  * @brief    IT defines which can be used with DDL_ADC_ReadReg and  DDL_ADC_WriteReg functions
  * @{
  */
#define DDL_ADC_IT_EOCS                     ADC_CTRL1_EOCIEN      /*!< ADC interruption ADC group regular end of unitary conversion or sequence conversions (to configure flag of end of conversion, use function @ref DDL_ADC_REG_SetFlagEndOfConversion() ) */
#define DDL_ADC_IT_EOS                      ADC_CTRL1_EOCIEN      /*!< ADC interruption ADC group regular end of sequence conversions */
#if defined (ADC_CTRL1_OVRIEN)
#define DDL_ADC_IT_OVR                      ADC_CTRL1_OVRIEN      /*!< ADC interruption ADC group regular overrun */
#endif /* ADC_CTRL1_OVRIEN */
#define DDL_ADC_IT_JEOS                     ADC_CTRL1_INJEOCIEN   /*!< ADC interruption ADC group injected end of sequence conversions (Note: on this APM32 series, there is no flag ADC group injected end of unitary conversion. Flag noted as "JEOC" is corresponding to flag "JEOS" in other APM32 families) */
#define DDL_ADC_IT_AWD1                     ADC_CTRL1_AWDIEN      /*!< ADC interruption ADC analog watchdog 1 */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_REGISTERS  ADC registers compliant with specific purpose
  * @{
  */
/* List of ADC registers intended to be used (most commonly) with             */
/* DMA transfer.                                                              */
/* Refer to function @ref DDL_ADC_DMA_GetRegAddr().                            */
#define DDL_ADC_DMA_REG_REGULAR_DATA          0x00000000UL   /* ADC group regular conversion data register (corresponding to register DR) to be used with ADC configured in independent mode. Without DMA transfer, register accessed by LL function @ref DDL_ADC_REG_ReadConversionData32() and other functions @ref DDL_ADC_REG_ReadConversionDatax() */
#if defined(ADC_MULTIMODE_SUPPORT)
#define DDL_ADC_DMA_REG_REGULAR_DATA_MULTI    0x00000001UL   /* ADC group regular conversion data register (corresponding to register CDR) to be used with ADC configured in multimode (available on APM32 devices with several ADC instances). Without DMA transfer, register accessed by LL function @ref DDL_ADC_REG_ReadMultiConversionData32() */
#endif
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_COMMON_CLOCK_SOURCE  ADC common - Clock source
  * @{
  */
#if defined (ADC_CCTRL_ADCPRE)
#define DDL_ADC_CLOCK_SYNC_PCLK_DIV2        0x00000000UL                                              /*!< ADC synchronous clock derived from AHB clock with prescaler division by 2 */
#define DDL_ADC_CLOCK_SYNC_PCLK_DIV4        (                     ADC_CCTRL_ADCPRE_0)                 /*!< ADC synchronous clock derived from AHB clock with prescaler division by 4 */
#define DDL_ADC_CLOCK_SYNC_PCLK_DIV6        (ADC_CCTRL_ADCPRE_1                     )                 /*!< ADC synchronous clock derived from AHB clock with prescaler division by 6 */
#define DDL_ADC_CLOCK_SYNC_PCLK_DIV8        (ADC_CCTRL_ADCPRE_1 | ADC_CCTRL_ADCPRE_0)                 /*!< ADC synchronous clock derived from AHB clock with prescaler division by 8 */
#endif /* ADC_CCTRL_ADCPRE */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_COMMON_PATH_INTERNAL  ADC common - Measurement path to internal channels
  * @{
  */
/* Note: Other measurement paths to internal channels may be available        */
/*       (connections to other peripherals).                                  */
/*       If they are not listed below, they do not require any specific       */
/*       path enable. In this case, Access to measurement path is done        */
/*       only by selecting the corresponding ADC internal channel.            */
#define DDL_ADC_PATH_INTERNAL_NONE          0x00000000UL              /*!< ADC measurement paths all disabled */
#if defined (ADC_CCTRL_TSVREFEN)
#define DDL_ADC_PATH_INTERNAL_VREFINT       (ADC_CCTRL_TSVREFEN)      /*!< ADC measurement path to internal channel VrefInt */
#define DDL_ADC_PATH_INTERNAL_TEMPSENSOR    (ADC_CCTRL_TSVREFEN)      /*!< ADC measurement path to internal channel temperature sensor */
#else
#define DDL_ADC_PATH_INTERNAL_VREFINT       (ADC_CTRL2_TSVREFEN)      /*!< ADC measurement path to internal channel VrefInt */
#define DDL_ADC_PATH_INTERNAL_TEMPSENSOR    (ADC_CTRL2_TSVREFEN)      /*!< ADC measurement path to internal channel temperature sensor */
#endif  /* ADC_CCTRL_TSVREFEN */
#if defined (ADC_CCTRL_VBATEN)
#define DDL_ADC_PATH_INTERNAL_VBAT          (ADC_CCTRL_VBATEN)        /*!< ADC measurement path to internal channel Vbat */
#endif /* ADC_CCTRL_VBATEN */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_RESOLUTION  ADC instance - Resolution
  * @{
  */
#define DDL_ADC_RESOLUTION_12B              0x00000000UL                                  /*!< ADC resolution 12 bits */
#if defined (ADC_CTRL1_RESSEL)
#define DDL_ADC_RESOLUTION_10B              (                     ADC_CTRL1_RESSEL_0)     /*!< ADC resolution 10 bits */
#define DDL_ADC_RESOLUTION_8B               (ADC_CTRL1_RESSEL_1                     )     /*!< ADC resolution  8 bits */
#define DDL_ADC_RESOLUTION_6B               (ADC_CTRL1_RESSEL_1 | ADC_CTRL1_RESSEL_0)     /*!< ADC resolution  6 bits */
#endif /* ADC_CTRL1_RESSEL */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_DATA_ALIGN  ADC instance - Data alignment
  * @{
  */
#define DDL_ADC_DATA_ALIGN_RIGHT            0x00000000UL            /*!< ADC conversion data alignment: right aligned (alignment on data register LSB bit 0)*/
#define DDL_ADC_DATA_ALIGN_LEFT             (ADC_CTRL2_DALIGNCFG)        /*!< ADC conversion data alignment: left aligned (alignment on data register MSB bit 15)*/
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_SCAN_SELECTION ADC instance - Scan selection
  * @{
  */
#define DDL_ADC_SEQ_SCAN_DISABLE            0x00000000UL    /*!< ADC conversion is performed in unitary conversion mode (one channel converted, that defined in rank 1). Configuration of both groups regular and injected sequencers (sequence length, ...) is discarded: equivalent to length of 1 rank.*/
#define DDL_ADC_SEQ_SCAN_ENABLE             (ADC_CTRL1_SCANEN) /*!< ADC conversions are performed in sequence conversions mode, according to configuration of both groups regular and injected sequencers (sequence length, ...). */
/**
  * @}
  */

