betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_adc.h
/** @defgroup ADC_DDL_EC_REG_DMA_TRANSFER  ADC group regular - DMA transfer of ADC conversion data
  * @{
  */
#define DDL_ADC_REG_DMA_TRANSFER_NONE       0x00000000UL              /*!< ADC conversions are not transferred by DMA */
#if defined (ADC_CTRL2_DMADISSEL)
#define DDL_ADC_REG_DMA_TRANSFER_LIMITED    (                      ADC_CTRL2_DMAEN)          /*!< ADC conversion data are transferred by DMA, in limited mode (one shot mode): DMA transfer requests are stopped when number of DMA data transfers (number of ADC conversions) is reached. This ADC mode is intended to be used with DMA mode non-circular. */
#define DDL_ADC_REG_DMA_TRANSFER_UNLIMITED  (ADC_CTRL2_DMADISSEL | ADC_CTRL2_DMAEN)          /*!< ADC conversion data are transferred by DMA, in unlimited mode: DMA transfer requests are unlimited, whatever number of DMA data transferred (number of ADC conversions). This ADC mode is intended to be used with DMA mode circular. */
#else
#define DDL_ADC_REG_DMA_TRANSFER_UNLIMITED  (                      ADC_CTRL2_DMAEN)          /*!< ADC conversion data are transferred by DMA, in unlimited mode: DMA transfer requests are unlimited, whatever number of DMA data transferred (number of ADC conversions). This ADC mode is intended to be used with DMA mode circular. */
#endif /* ADC_CTRL2_DMADISSEL */

/**
  * @}
  */

/** @defgroup ADC_DDL_EC_REG_FLAG_EOC_SELECTION ADC group regular - Flag EOC selection (unitary or sequence conversions)
  * @{
  */
#if defined (ADC_CTRL2_EOCSEL)
#define DDL_ADC_REG_FLAG_EOC_SEQUENCE_CONV        0x00000000UL       /*!< ADC flag EOC (end of unitary conversion) selected */
#define DDL_ADC_REG_FLAG_EOC_UNITARY_CONV        (ADC_CTRL2_EOCSEL)  /*!< ADC flag EOS (end of sequence conversions) selected */
#endif /* ADC_CTRL2_EOCSEL */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_REG_SEQ_SCAN_LENGTH  ADC group regular - Sequencer scan length
  * @{
  */
#define DDL_ADC_REG_SEQ_SCAN_DISABLE         0x00000000UL                                                                                           /*!< ADC group regular sequencer disable (equivalent to sequencer of 1 rank: ADC conversion on only 1 channel) */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_2RANKS  (                                                                              ADC_REGSEQ1_REGSEQLEN_0) /*!< ADC group regular sequencer enable with 2 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS  (                                                    ADC_REGSEQ1_REGSEQLEN_1                          ) /*!< ADC group regular sequencer enable with 3 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS  (                                                    ADC_REGSEQ1_REGSEQLEN_1 | ADC_REGSEQ1_REGSEQLEN_0) /*!< ADC group regular sequencer enable with 4 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_5RANKS  (                         ADC_REGSEQ1_REGSEQLEN_2                                                     ) /*!< ADC group regular sequencer enable with 5 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_6RANKS  (                         ADC_REGSEQ1_REGSEQLEN_2                            | ADC_REGSEQ1_REGSEQLEN_0) /*!< ADC group regular sequencer enable with 6 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_7RANKS  (                         ADC_REGSEQ1_REGSEQLEN_2  | ADC_REGSEQ1_REGSEQLEN_1                          ) /*!< ADC group regular sequencer enable with 7 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_8RANKS  (                         ADC_REGSEQ1_REGSEQLEN_2  | ADC_REGSEQ1_REGSEQLEN_1 | ADC_REGSEQ1_REGSEQLEN_0) /*!< ADC group regular sequencer enable with 8 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_9RANKS  (ADC_REGSEQ1_REGSEQLEN_3                                                                              ) /*!< ADC group regular sequencer enable with 9 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_10RANKS (ADC_REGSEQ1_REGSEQLEN_3                                                     | ADC_REGSEQ1_REGSEQLEN_0) /*!< ADC group regular sequencer enable with 10 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_11RANKS (ADC_REGSEQ1_REGSEQLEN_3                           | ADC_REGSEQ1_REGSEQLEN_1                          ) /*!< ADC group regular sequencer enable with 11 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_12RANKS (ADC_REGSEQ1_REGSEQLEN_3                           | ADC_REGSEQ1_REGSEQLEN_1 | ADC_REGSEQ1_REGSEQLEN_0) /*!< ADC group regular sequencer enable with 12 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_13RANKS (ADC_REGSEQ1_REGSEQLEN_3 | ADC_REGSEQ1_REGSEQLEN_2                                                    ) /*!< ADC group regular sequencer enable with 13 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_14RANKS (ADC_REGSEQ1_REGSEQLEN_3 | ADC_REGSEQ1_REGSEQLEN_2                           | ADC_REGSEQ1_REGSEQLEN_0) /*!< ADC group regular sequencer enable with 14 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_15RANKS (ADC_REGSEQ1_REGSEQLEN_3 | ADC_REGSEQ1_REGSEQLEN_2 | ADC_REGSEQ1_REGSEQLEN_1                          ) /*!< ADC group regular sequencer enable with 15 ranks in the sequence */
#define DDL_ADC_REG_SEQ_SCAN_ENABLE_16RANKS (ADC_REGSEQ1_REGSEQLEN_3 | ADC_REGSEQ1_REGSEQLEN_2 | ADC_REGSEQ1_REGSEQLEN_1 | ADC_REGSEQ1_REGSEQLEN_0) /*!< ADC group regular sequencer enable with 16 ranks in the sequence */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_REG_SEQ_DISCONT_MODE  ADC group regular - Sequencer discontinuous mode
  * @{
  */
#define DDL_ADC_REG_SEQ_DISCONT_DISABLE     0x00000000UL                                                                                     /*!< ADC group regular sequencer discontinuous mode disable */
#define DDL_ADC_REG_SEQ_DISCONT_1RANK       (                                                                           ADC_CTRL1_REGDISCEN) /*!< ADC group regular sequencer discontinuous mode enable with sequence interruption every rank */
#define DDL_ADC_REG_SEQ_DISCONT_2RANKS      (                                                  ADC_CTRL1_DISCNUMCFG_0 | ADC_CTRL1_REGDISCEN) /*!< ADC group regular sequencer discontinuous mode enabled with sequence interruption every 2 ranks */
#define DDL_ADC_REG_SEQ_DISCONT_3RANKS      (                         ADC_CTRL1_DISCNUMCFG_1                          | ADC_CTRL1_REGDISCEN) /*!< ADC group regular sequencer discontinuous mode enable with sequence interruption every 3 ranks */
#define DDL_ADC_REG_SEQ_DISCONT_4RANKS      (                         ADC_CTRL1_DISCNUMCFG_1 | ADC_CTRL1_DISCNUMCFG_0 | ADC_CTRL1_REGDISCEN) /*!< ADC group regular sequencer discontinuous mode enable with sequence interruption every 4 ranks */
#define DDL_ADC_REG_SEQ_DISCONT_5RANKS      (ADC_CTRL1_DISCNUMCFG_2                                                   | ADC_CTRL1_REGDISCEN) /*!< ADC group regular sequencer discontinuous mode enable with sequence interruption every 5 ranks */
#define DDL_ADC_REG_SEQ_DISCONT_6RANKS      (ADC_CTRL1_DISCNUMCFG_2                          | ADC_CTRL1_DISCNUMCFG_0 | ADC_CTRL1_REGDISCEN) /*!< ADC group regular sequencer discontinuous mode enable with sequence interruption every 6 ranks */
#define DDL_ADC_REG_SEQ_DISCONT_7RANKS      (ADC_CTRL1_DISCNUMCFG_2 | ADC_CTRL1_DISCNUMCFG_1                          | ADC_CTRL1_REGDISCEN) /*!< ADC group regular sequencer discontinuous mode enable with sequence interruption every 7 ranks */
#define DDL_ADC_REG_SEQ_DISCONT_8RANKS      (ADC_CTRL1_DISCNUMCFG_2 | ADC_CTRL1_DISCNUMCFG_1 | ADC_CTRL1_DISCNUMCFG_0 | ADC_CTRL1_REGDISCEN) /*!< ADC group regular sequencer discontinuous mode enable with sequence interruption every 8 ranks */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_REG_SEQ_RANKS  ADC group regular - Sequencer ranks
  * @{
  */
#define DDL_ADC_REG_RANK_1                  (ADC_REGSEQ3_REGOFFSET | ADC_REG_RANK_1_SQRX_BITOFFSET_POS)  /*!< ADC group regular sequencer rank 1 */
#define DDL_ADC_REG_RANK_2                  (ADC_REGSEQ3_REGOFFSET | ADC_REG_RANK_2_SQRX_BITOFFSET_POS)  /*!< ADC group regular sequencer rank 2 */
#define DDL_ADC_REG_RANK_3                  (ADC_REGSEQ3_REGOFFSET | ADC_REG_RANK_3_SQRX_BITOFFSET_POS)  /*!< ADC group regular sequencer rank 3 */
#define DDL_ADC_REG_RANK_4                  (ADC_REGSEQ3_REGOFFSET | ADC_REG_RANK_4_SQRX_BITOFFSET_POS)  /*!< ADC group regular sequencer rank 4 */
#define DDL_ADC_REG_RANK_5                  (ADC_REGSEQ3_REGOFFSET | ADC_REG_RANK_5_SQRX_BITOFFSET_POS)  /*!< ADC group regular sequencer rank 5 */
#define DDL_ADC_REG_RANK_6                  (ADC_REGSEQ3_REGOFFSET | ADC_REG_RANK_6_SQRX_BITOFFSET_POS)  /*!< ADC group regular sequencer rank 6 */
#define DDL_ADC_REG_RANK_7                  (ADC_REGSEQ2_REGOFFSET | ADC_REG_RANK_7_SQRX_BITOFFSET_POS)  /*!< ADC group regular sequencer rank 7 */
#define DDL_ADC_REG_RANK_8                  (ADC_REGSEQ2_REGOFFSET | ADC_REG_RANK_8_SQRX_BITOFFSET_POS)  /*!< ADC group regular sequencer rank 8 */
#define DDL_ADC_REG_RANK_9                  (ADC_REGSEQ2_REGOFFSET | ADC_REG_RANK_9_SQRX_BITOFFSET_POS)  /*!< ADC group regular sequencer rank 9 */
#define DDL_ADC_REG_RANK_10                 (ADC_REGSEQ2_REGOFFSET | ADC_REG_RANK_10_SQRX_BITOFFSET_POS) /*!< ADC group regular sequencer rank 10 */
#define DDL_ADC_REG_RANK_11                 (ADC_REGSEQ2_REGOFFSET | ADC_REG_RANK_11_SQRX_BITOFFSET_POS) /*!< ADC group regular sequencer rank 11 */
#define DDL_ADC_REG_RANK_12                 (ADC_REGSEQ2_REGOFFSET | ADC_REG_RANK_12_SQRX_BITOFFSET_POS) /*!< ADC group regular sequencer rank 12 */
#define DDL_ADC_REG_RANK_13                 (ADC_REGSEQ1_REGOFFSET | ADC_REG_RANK_13_SQRX_BITOFFSET_POS) /*!< ADC group regular sequencer rank 13 */
#define DDL_ADC_REG_RANK_14                 (ADC_REGSEQ1_REGOFFSET | ADC_REG_RANK_14_SQRX_BITOFFSET_POS) /*!< ADC group regular sequencer rank 14 */
#define DDL_ADC_REG_RANK_15                 (ADC_REGSEQ1_REGOFFSET | ADC_REG_RANK_15_SQRX_BITOFFSET_POS) /*!< ADC group regular sequencer rank 15 */
#define DDL_ADC_REG_RANK_16                 (ADC_REGSEQ1_REGOFFSET | ADC_REG_RANK_16_SQRX_BITOFFSET_POS) /*!< ADC group regular sequencer rank 16 */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_INJ_TRIGGER_SOURCE  ADC group injected - Trigger source
  * @{
  */
#if defined (ADC_CTRL2_INJGEXTTRGSEL_3)
#define DDL_ADC_INJ_TRIG_SOFTWARE           0x00000000UL                                                                                                                                    /*!< ADC group injected conversion trigger internal: SW start. */
#define DDL_ADC_INJ_TRIG_EXT_TMR1_CH4       (ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                                                                                                                 /*!< ADC group injected conversion trigger from external IP: TIM1 channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR1_TRGO      (ADC_CTRL2_INJGEXTTRGSEL_0 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                                                                                     /*!< ADC group injected conversion trigger from external IP: TIM1 TRGO. Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR2_CH1       (ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                                                                                     /*!< ADC group injected conversion trigger from external IP: TIM2 channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR2_TRGO      (ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_CTRL2_INJGEXTTRGSEL_0 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                                                         /*!< ADC group injected conversion trigger from external IP: TIM2 TRGO. Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR3_CH2       (ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                                                                                     /*!< ADC group injected conversion trigger from external IP: TIM3 channel 2 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR3_CH4       (ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_0 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                                                         /*!< ADC group injected conversion trigger from external IP: TIM3 channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR4_CH1       (ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                                                         /*!< ADC group injected conversion trigger from external IP: TIM4 channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR4_CH2       (ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_CTRL2_INJGEXTTRGSEL_0 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                             /*!< ADC group injected conversion trigger from external IP: TIM4 channel 2 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR4_CH3       (ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                                                                                     /*!< ADC group injected conversion trigger from external IP: TIM4 channel 3 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR4_TRGO      (ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_0 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                                                         /*!< ADC group injected conversion trigger from external IP: TIM4 TRGO. Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR5_CH4       (ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                                                         /*!< ADC group injected conversion trigger from external IP: TIM5 channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR5_TRGO      (ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_CTRL2_INJGEXTTRGSEL_0 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                             /*!< ADC group injected conversion trigger from external IP: TIM5 TRGO. Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR8_CH2       (ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                                                         /*!< ADC group injected conversion trigger from external IP: TIM8 channel 2 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR8_CH3       (ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_0 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                             /*!< ADC group injected conversion trigger from external IP: TIM8 channel 3 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR8_CH4       (ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT)                             /*!< ADC group injected conversion trigger from external IP: TIM8 channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_EXTI_LINE15    (ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_CTRL2_INJGEXTTRGSEL_0 | ADC_INJ_TRIG_EXT_EDGE_DEFAULT) /*!< ADC group injected conversion trigger from external IP: external interrupt line 15. Trigger edge set to rising edge (default setting). */
#else
#define DDL_ADC_INJ_TRIG_EXT_TMR1_TRGO      (0x00000000UL)                                                                               /*!< ADC group injected conversion trigger from external IP: TIM1 TRGO. Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR1_CH4       (ADC_CTRL2_INJGEXTTRGSEL_0)                                                                 /*!< ADC group injected conversion trigger from external IP: TIM1 channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR2_TRGO      (ADC_CTRL2_INJGEXTTRGSEL_1)                                                                /*!< ADC group injected conversion trigger from external IP: TIM2 TRGO. Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR2_CH1       (ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_CTRL2_INJGEXTTRGSEL_0)                                   /*!< ADC group injected conversion trigger from external IP: TIM2 channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR3_CH4       (ADC_CTRL2_INJGEXTTRGSEL_2)                                                              /*!< ADC group injected conversion trigger from external IP: TIM3 channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR4_TRGO      (ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_0)                                 /*!< ADC group injected conversion trigger from external IP: TIM4 TRGO. Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_EXTI_LINE15    (ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_1)                                /*!< ADC group injected conversion trigger from external IP: external interrupt line 15. Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_SOFTWARE           (ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_CTRL2_INJGEXTTRGSEL_0)   /*!< ADC group injected conversion trigger internal: SW start. */
/* ADC group injected external triggers for ADC instances: ADC3 (for ADC instances ADCx available on the selected device) */
#define DDL_ADC_INJ_TRIG_EXT_TMR4_CH3       (DDL_ADC_INJ_TRIG_EXT_TMR2_TRGO)        /*!< ADC group injected conversion trigger from external IP: TIM4 channel 3 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR8_CH2       (DDL_ADC_INJ_TRIG_EXT_TMR2_CH1)        /*!< ADC group injected conversion trigger from external IP: TIM8 channel 2 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR8_CH4       (DDL_ADC_INJ_TRIG_EXT_TMR3_CH4)       /*!< ADC group injected conversion trigger from external IP: TIM8 channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR5_TRGO      (DDL_ADC_INJ_TRIG_EXT_TMR4_TRGO)     /*!< ADC group injected conversion trigger from external IP: TIM5 TRGO. Trigger edge set to rising edge (default setting). */
#define DDL_ADC_INJ_TRIG_EXT_TMR5_CH4       (DDL_ADC_INJ_TRIG_EXT_EXTI_LINE15)  /*!< ADC group injected conversion trigger from external IP: TIM5 channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#endif /* ADC_CTRL2_INJGEXTTRGSEL_3 */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_INJ_TRIGGER_EDGE  ADC group injected - Trigger edge
  * @{
  */
#define DDL_ADC_INJ_TRIG_EXT_RISING         (                          ADC_CTRL2_INJEXTTRGEN_0)   /*!< ADC group injected conversion trigger polarity set to rising edge */
#if defined (ADC_CTRL2_INJEXTTRGEN_1)
#define DDL_ADC_INJ_TRIG_EXT_FALLING        (ADC_CTRL2_INJEXTTRGEN_1                          )   /*!< ADC group injected conversion trigger polarity set to falling edge */
#define DDL_ADC_INJ_TRIG_EXT_RISINGFALLING  (ADC_CTRL2_INJEXTTRGEN_1 | ADC_CTRL2_INJEXTTRGEN_0)   /*!< ADC group injected conversion trigger polarity set to both rising and falling edges */
#endif /* ADC_CTRL2_INJEXTTRGEN_1 */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_INJ_TRIG_AUTO  ADC group injected - Automatic trigger mode
* @{
*/
#define DDL_ADC_INJ_TRIG_INDEPENDENT        0x00000000UL            /*!< ADC group injected conversion trigger independent. Setting mandatory if ADC group injected injected trigger source is set to an external trigger. */
#define DDL_ADC_INJ_TRIG_FROM_GRP_REGULAR   (ADC_CTRL1_INJGACEN)        /*!< ADC group injected conversion trigger from ADC group regular. Setting compliant only with group injected trigger source set to SW start, without any further action on  ADC group injected conversion start or stop: in this case, ADC group injected is controlled only from ADC group regular. */
/**
  * @}
  */


/** @defgroup ADC_DDL_EC_INJ_SEQ_SCAN_LENGTH  ADC group injected - Sequencer scan length
  * @{
  */
#define DDL_ADC_INJ_SEQ_SCAN_DISABLE        0x00000000UL                                      /*!< ADC group injected sequencer disable (equivalent to sequencer of 1 rank: ADC conversion on only 1 channel) */
#define DDL_ADC_INJ_SEQ_SCAN_ENABLE_2RANKS  (                         ADC_INJSEQ_INJSEQLEN_0) /*!< ADC group injected sequencer enable with 2 ranks in the sequence */
#define DDL_ADC_INJ_SEQ_SCAN_ENABLE_3RANKS  (ADC_INJSEQ_INJSEQLEN_1                         ) /*!< ADC group injected sequencer enable with 3 ranks in the sequence */
#define DDL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS  (ADC_INJSEQ_INJSEQLEN_1 | ADC_INJSEQ_INJSEQLEN_0) /*!< ADC group injected sequencer enable with 4 ranks in the sequence */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_INJ_SEQ_DISCONT_MODE  ADC group injected - Sequencer discontinuous mode
  * @{
  */
#define DDL_ADC_INJ_SEQ_DISCONT_DISABLE     0x00000000UL            /*!< ADC group injected sequencer discontinuous mode disable */
#define DDL_ADC_INJ_SEQ_DISCONT_1RANK       (ADC_CTRL1_INJDISCEN)      /*!< ADC group injected sequencer discontinuous mode enable with sequence interruption every rank */
/**
  * @}
  */

