betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_adc.h
/** @defgroup ADC_DDL_EC_INJ_SEQ_RANKS  ADC group injected - Sequencer ranks
  * @{
  */
#define DDL_ADC_INJ_RANK_1                  (ADC_INJDATA1_REGOFFSET | ADC_INJDOF1_REGOFFSET | 0x00000001UL) /*!< ADC group injected sequencer rank 1 */
#define DDL_ADC_INJ_RANK_2                  (ADC_INJDATA2_REGOFFSET | ADC_INJDOF2_REGOFFSET | 0x00000002UL) /*!< ADC group injected sequencer rank 2 */
#define DDL_ADC_INJ_RANK_3                  (ADC_INJDATA3_REGOFFSET | ADC_INJDOF3_REGOFFSET | 0x00000003UL) /*!< ADC group injected sequencer rank 3 */
#define DDL_ADC_INJ_RANK_4                  (ADC_INJDATA4_REGOFFSET | ADC_INJDOF4_REGOFFSET | 0x00000004UL) /*!< ADC group injected sequencer rank 4 */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_CHANNEL_SAMPLINGTIME  Channel - Sampling time
  * @{
  */
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
#define DDL_ADC_SAMPLINGTIME_3CYCLES        0x00000000UL                                                     /*!< Sampling time 3 ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_15CYCLES       (ADC_SMPTIM1_SMPCYCCFG10_0)                                      /*!< Sampling time 15 ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_28CYCLES       (ADC_SMPTIM1_SMPCYCCFG10_1)                                      /*!< Sampling time 28 ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_56CYCLES       (ADC_SMPTIM1_SMPCYCCFG10_1 | ADC_SMPTIM1_SMPCYCCFG10_0)          /*!< Sampling time 56 ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_84CYCLES       (ADC_SMPTIM1_SMPCYCCFG10_2)                                      /*!< Sampling time 84 ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_112CYCLES      (ADC_SMPTIM1_SMPCYCCFG10_2 | ADC_SMPTIM1_SMPCYCCFG10_0)          /*!< Sampling time 112 ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_144CYCLES      (ADC_SMPTIM1_SMPCYCCFG10_2 | ADC_SMPTIM1_SMPCYCCFG10_1)          /*!< Sampling time 144 ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_480CYCLES      (ADC_SMPTIM1_SMPCYCCFG10)                                        /*!< Sampling time 480 ADC clock cycles */
#else
#define DDL_ADC_SAMPLINGTIME_1CYCLE_5       DDL_ADC_SAMPLINGTIME_3CYCLES    /*!< Sampling time 1.5   ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_7CYCLES_5      DDL_ADC_SAMPLINGTIME_15CYCLES   /*!< Sampling time 7.5   ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_13CYCLES_5     DDL_ADC_SAMPLINGTIME_28CYCLES   /*!< Sampling time 13.5  ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_28CYCLES_5     DDL_ADC_SAMPLINGTIME_56CYCLES   /*!< Sampling time 28.5  ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_41CYCLES_5     DDL_ADC_SAMPLINGTIME_84CYCLES   /*!< Sampling time 41.5  ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_55CYCLES_5     DDL_ADC_SAMPLINGTIME_112CYCLES  /*!< Sampling time 55.5  ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_71CYCLES_5     DDL_ADC_SAMPLINGTIME_144CYCLES  /*!< Sampling time 71.5  ADC clock cycles */
#define DDL_ADC_SAMPLINGTIME_239CYCLES_5    DDL_ADC_SAMPLINGTIME_480CYCLES  /*!< Sampling time 239.5 ADC clock cycles */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_AWD_NUMBER Analog watchdog - Analog watchdog number
  * @{
  */
#define DDL_ADC_AWD1                        (ADC_AWD_CTRL1_CHANNEL_MASK  | ADC_AWD_CTRL1_REGOFFSET) /*!< ADC analog watchdog number 1 */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_AWD_CHANNELS  Analog watchdog - Monitored channels
  * @{
  */
#define DDL_ADC_AWD_DISABLE                 0x00000000UL                                                                                                /*!< ADC analog watchdog monitoring disabled */
#define DDL_ADC_AWD_ALL_CHANNELS_REG        (                                                                  ADC_CTRL1_REGAWDEN                     ) /*!< ADC analog watchdog monitoring of all channels, converted by group regular only */
#define DDL_ADC_AWD_ALL_CHANNELS_INJ        (                                             ADC_CTRL1_INJAWDEN                                          ) /*!< ADC analog watchdog monitoring of all channels, converted by group injected only */
#define DDL_ADC_AWD_ALL_CHANNELS_REG_INJ    (                                             ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN                     ) /*!< ADC analog watchdog monitoring of all channels, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_0_REG           ((DDL_ADC_CHANNEL_0  & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN0, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_0_INJ           ((DDL_ADC_CHANNEL_0  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN0, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_0_REG_INJ       ((DDL_ADC_CHANNEL_0  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN0, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_1_REG           ((DDL_ADC_CHANNEL_1  & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN1, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_1_INJ           ((DDL_ADC_CHANNEL_1  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN1, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_1_REG_INJ       ((DDL_ADC_CHANNEL_1  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN1, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_2_REG           ((DDL_ADC_CHANNEL_2  & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN2, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_2_INJ           ((DDL_ADC_CHANNEL_2  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN2, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_2_REG_INJ       ((DDL_ADC_CHANNEL_2  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN2, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_3_REG           ((DDL_ADC_CHANNEL_3  & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN3, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_3_INJ           ((DDL_ADC_CHANNEL_3  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN3, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_3_REG_INJ       ((DDL_ADC_CHANNEL_3  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN3, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_4_REG           ((DDL_ADC_CHANNEL_4  & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN4, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_4_INJ           ((DDL_ADC_CHANNEL_4  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN4, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_4_REG_INJ       ((DDL_ADC_CHANNEL_4  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN4, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_5_REG           ((DDL_ADC_CHANNEL_5  & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN5, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_5_INJ           ((DDL_ADC_CHANNEL_5  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN5, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_5_REG_INJ       ((DDL_ADC_CHANNEL_5  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN5, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_6_REG           ((DDL_ADC_CHANNEL_6  & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN6, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_6_INJ           ((DDL_ADC_CHANNEL_6  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN6, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_6_REG_INJ       ((DDL_ADC_CHANNEL_6  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN6, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_7_REG           ((DDL_ADC_CHANNEL_7  & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN7, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_7_INJ           ((DDL_ADC_CHANNEL_7  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN7, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_7_REG_INJ       ((DDL_ADC_CHANNEL_7  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN7, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_8_REG           ((DDL_ADC_CHANNEL_8  & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN8, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_8_INJ           ((DDL_ADC_CHANNEL_8  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN8, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_8_REG_INJ       ((DDL_ADC_CHANNEL_8  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN8, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_9_REG           ((DDL_ADC_CHANNEL_9  & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN9, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_9_INJ           ((DDL_ADC_CHANNEL_9  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN9, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_9_REG_INJ       ((DDL_ADC_CHANNEL_9  & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN9, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_10_REG          ((DDL_ADC_CHANNEL_10 & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN10, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_10_INJ          ((DDL_ADC_CHANNEL_10 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN10, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_10_REG_INJ      ((DDL_ADC_CHANNEL_10 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN10, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_11_REG          ((DDL_ADC_CHANNEL_11 & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN11, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_11_INJ          ((DDL_ADC_CHANNEL_11 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN11, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_11_REG_INJ      ((DDL_ADC_CHANNEL_11 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN11, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_12_REG          ((DDL_ADC_CHANNEL_12 & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN12, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_12_INJ          ((DDL_ADC_CHANNEL_12 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN12, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_12_REG_INJ      ((DDL_ADC_CHANNEL_12 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN12, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_13_REG          ((DDL_ADC_CHANNEL_13 & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN13, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_13_INJ          ((DDL_ADC_CHANNEL_13 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN13, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_13_REG_INJ      ((DDL_ADC_CHANNEL_13 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN13, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_14_REG          ((DDL_ADC_CHANNEL_14 & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN14, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_14_INJ          ((DDL_ADC_CHANNEL_14 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN14, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_14_REG_INJ      ((DDL_ADC_CHANNEL_14 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN14, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_15_REG          ((DDL_ADC_CHANNEL_15 & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN15, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_15_INJ          ((DDL_ADC_CHANNEL_15 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN15, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_15_REG_INJ      ((DDL_ADC_CHANNEL_15 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN15, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_16_REG          ((DDL_ADC_CHANNEL_16 & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN16, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_16_INJ          ((DDL_ADC_CHANNEL_16 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN16, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_16_REG_INJ      ((DDL_ADC_CHANNEL_16 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN16, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_17_REG          ((DDL_ADC_CHANNEL_17 & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN17, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_17_INJ          ((DDL_ADC_CHANNEL_17 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN17, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_17_REG_INJ      ((DDL_ADC_CHANNEL_17 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN17, converted by either group regular or injected */
#define DDL_ADC_AWD_CHANNEL_18_REG          ((DDL_ADC_CHANNEL_18 & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN18, converted by group regular only */
#define DDL_ADC_AWD_CHANNEL_18_INJ          ((DDL_ADC_CHANNEL_18 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN18, converted by group injected only */
#define DDL_ADC_AWD_CHANNEL_18_REG_INJ      ((DDL_ADC_CHANNEL_18 & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC external channel (channel connected to GPIO pin) ADCx_IN18, converted by either group regular or injected */
#define DDL_ADC_AWD_CH_VREFINT_REG          ((DDL_ADC_CHANNEL_VREFINT    & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to VrefInt: Internal voltage reference, converted by group regular only */
#define DDL_ADC_AWD_CH_VREFINT_INJ          ((DDL_ADC_CHANNEL_VREFINT    & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to VrefInt: Internal voltage reference, converted by group injected only */
#define DDL_ADC_AWD_CH_VREFINT_REG_INJ      ((DDL_ADC_CHANNEL_VREFINT    & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to VrefInt: Internal voltage reference, converted by either group regular or injected */
#define DDL_ADC_AWD_CH_VBAT_REG             ((DDL_ADC_CHANNEL_VBAT       & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to Vbat/3: Vbat voltage through a divider ladder of factor 1/3 to have Vbat always below Vdda, converted by group regular only */
#define DDL_ADC_AWD_CH_VBAT_INJ             ((DDL_ADC_CHANNEL_VBAT       & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to Vbat/3: Vbat voltage through a divider ladder of factor 1/3 to have Vbat always below Vdda, converted by group injected only */
#define DDL_ADC_AWD_CH_VBAT_REG_INJ         ((DDL_ADC_CHANNEL_VBAT       & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to Vbat/3: Vbat voltage through a divider ladder of factor 1/3 to have Vbat always below Vdda */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || defined(APM32F403xx) || defined(APM32F402xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define DDL_ADC_AWD_CH_TEMPSENSOR_REG       ((DDL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to Temperature sensor, converted by group regular only */
