betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_adc.h
#define DDL_ADC_AWD_CH_TEMPSENSOR_INJ       ((DDL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to Temperature sensor, converted by group injected only */
#define DDL_ADC_AWD_CH_TEMPSENSOR_REG_INJ   ((DDL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to Temperature sensor, converted by either group regular or injected */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F403xx || APM32F402xx || APM32F423xx || APM32F425xx || APM32F427xx */
#if defined(APM32F411xx)
#define DDL_ADC_AWD_CH_TEMPSENSOR_REG       ((DDL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK)                      | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to Temperature sensor, converted by group regular only. This internal channel is shared between temperature sensor and Vbat, only 1 measurement path must be enabled. */
#define DDL_ADC_AWD_CH_TEMPSENSOR_INJ       ((DDL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN                      | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to Temperature sensor, converted by group injected only. This internal channel is shared between temperature sensor and Vbat, only 1 measurement path must be enabled. */
#define DDL_ADC_AWD_CH_TEMPSENSOR_REG_INJ   ((DDL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK) | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_AWDSGLEN) /*!< ADC analog watchdog monitoring of ADC internal channel connected to Temperature sensor, converted by either group regular or injected. This internal channel is shared between temperature sensor and Vbat, only 1 measurement path must be enabled. */
#endif /* APM32F411xx */
/**
  * @}
  */

#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @defgroup ADC_DDL_EC_OVS_DISCONT_MODE  Oversampling - Discontinuous mode
  * @{
  */
#define DDL_ADC_OVS_REG_CONT                (0x00000000UL)      /*!< ADC oversampling discontinuous mode: continuous mode (all conversions of oversampling are done from 1 trigger) */
#define DDL_ADC_OVS_REG_DISCONT             (ADC_OSAMPCTRL_TOS) /*!< ADC oversampling discontinuous mode: discontinuous mode (each conversion of oversampling needs a trigger) */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_OVS_RATIO  Oversampling - Ratio
  * @{
  */
#define DDL_ADC_OVS_RATIO_2                 (0x00000000UL)                                                     /*!< ADC oversampling ratio of 2 (2 ADC conversions are performed, sum of these conversions data is computed to result as the ADC oversampling conversion data (before potential shift) */
#define DDL_ADC_OVS_RATIO_4                 (                                            ADC_OSAMPCTRL_OSR_0)  /*!< ADC oversampling ratio of 4 (4 ADC conversions are performed, sum of these conversions data is computed to result as the ADC oversampling conversion data (before potential shift) */
#define DDL_ADC_OVS_RATIO_8                 (                      ADC_OSAMPCTRL_OSR_1                      )  /*!< ADC oversampling ratio of 8 (8 ADC conversions are performed, sum of these conversions data is computed to result as the ADC oversampling conversion data (before potential shift) */
#define DDL_ADC_OVS_RATIO_16                (                      ADC_OSAMPCTRL_OSR_1 | ADC_OSAMPCTRL_OSR_0)  /*!< ADC oversampling ratio of 16 (16 ADC conversions are performed, sum of these conversions data is computed to result as the ADC oversampling conversion data (before potential shift) */
#define DDL_ADC_OVS_RATIO_32                (ADC_OSAMPCTRL_OSR_2                                            )  /*!< ADC oversampling ratio of 32 (32 ADC conversions are performed, sum of these conversions data is computed to result as the ADC oversampling conversion data (before potential shift) */
#define DDL_ADC_OVS_RATIO_64                (ADC_OSAMPCTRL_OSR_2                       | ADC_OSAMPCTRL_OSR_0)  /*!< ADC oversampling ratio of 64 (64 ADC conversions are performed, sum of these conversions data is computed to result as the ADC oversampling conversion data (before potential shift) */
#define DDL_ADC_OVS_RATIO_128               (ADC_OSAMPCTRL_OSR_2 | ADC_OSAMPCTRL_OSR_1                      )  /*!< ADC oversampling ratio of 128 (128 ADC conversions are performed, sum of these conversions data is computed to result as the ADC oversampling conversion data (before potential shift) */
#define DDL_ADC_OVS_RATIO_256               (ADC_OSAMPCTRL_OSR_2 | ADC_OSAMPCTRL_OSR_1 | ADC_OSAMPCTRL_OSR_0)  /*!< ADC oversampling ratio of 256 (256 ADC conversions are performed, sum of these conversions data is computed to result as the ADC oversampling conversion data (before potential shift) */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_OVS_SHIFT  Oversampling - Data shift
  * @{
  */
#define DDL_ADC_OVS_SHIFT_NONE              (0x00000000UL)                                                                         /*!< ADC oversampling no shift (sum of the ADC conversions data is not divided to result as the ADC oversampling conversion data) */
#define DDL_ADC_OVS_SHIFT_RIGHT_1           (                                                                 ADC_OSAMPCTRL_OSS_0) /*!< ADC oversampling shift of 1 (sum of the ADC conversions data is divided by 2 to result as the ADC oversampling conversion data) */
#define DDL_ADC_OVS_SHIFT_RIGHT_2           (                                           ADC_OSAMPCTRL_OSS_1                      ) /*!< ADC oversampling shift of 2 (sum of the ADC conversions data is divided by 4 to result as the ADC oversampling conversion data) */
#define DDL_ADC_OVS_SHIFT_RIGHT_3           (                                           ADC_OSAMPCTRL_OSS_1 | ADC_OSAMPCTRL_OSS_0) /*!< ADC oversampling shift of 3 (sum of the ADC conversions data is divided by 8 to result as the ADC oversampling conversion data) */
#define DDL_ADC_OVS_SHIFT_RIGHT_4           (                     ADC_OSAMPCTRL_OSS_2                                            ) /*!< ADC oversampling shift of 4 (sum of the ADC conversions data is divided by 16 to result as the ADC oversampling conversion data) */
#define DDL_ADC_OVS_SHIFT_RIGHT_5           (                     ADC_OSAMPCTRL_OSS_2                       | ADC_OSAMPCTRL_OSS_0) /*!< ADC oversampling shift of 5 (sum of the ADC conversions data is divided by 32 to result as the ADC oversampling conversion data) */
#define DDL_ADC_OVS_SHIFT_RIGHT_6           (                     ADC_OSAMPCTRL_OSS_2 | ADC_OSAMPCTRL_OSS_1                      ) /*!< ADC oversampling shift of 6 (sum of the ADC conversions data is divided by 64 to result as the ADC oversampling conversion data) */
#define DDL_ADC_OVS_SHIFT_RIGHT_7           (                     ADC_OSAMPCTRL_OSS_2 | ADC_OSAMPCTRL_OSS_1 | ADC_OSAMPCTRL_OSS_0) /*!< ADC oversampling shift of 7 (sum of the ADC conversions data is divided by 128 to result as the ADC oversampling conversion data) */
#define DDL_ADC_OVS_SHIFT_RIGHT_8           (ADC_OSAMPCTRL_OSS_3                                                                 ) /*!< ADC oversampling shift of 8 (sum of the ADC conversions data is divided by 256 to result as the ADC oversampling conversion data) */
/**
  * @}
  */

#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

/** @defgroup ADC_DDL_EC_AWD_THRESHOLDS  Analog watchdog - Thresholds
  * @{
  */
#define DDL_ADC_AWD_THRESHOLD_HIGH          (ADC_AWD_TR1_HIGH_REGOFFSET) /*!< ADC analog watchdog threshold high */
#define DDL_ADC_AWD_THRESHOLD_LOW           (ADC_AWD_TR1_LOW_REGOFFSET)  /*!< ADC analog watchdog threshold low */
/**
  * @}
  */

#if defined(ADC_MULTIMODE_SUPPORT)
/** @defgroup ADC_DDL_EC_MULTI_MODE  Multimode - Mode
  * @{
  */
#if defined (ADC_CCTRL_ADCMSEL)
#define DDL_ADC_MULTI_INDEPENDENT           0x00000000UL                                                                           /*!< ADC dual mode disabled (ADC independent mode) */
#define DDL_ADC_MULTI_DUAL_REG_SIMULT       (                     ADC_CCTRL_ADCMSEL_2 | ADC_CCTRL_ADCMSEL_1                      ) /*!< ADC dual mode enabled: group regular simultaneous */
#define DDL_ADC_MULTI_DUAL_REG_INTERL       (                     ADC_CCTRL_ADCMSEL_2 | ADC_CCTRL_ADCMSEL_1 | ADC_CCTRL_ADCMSEL_0) /*!< ADC dual mode enabled: Combined group regular interleaved */
#define DDL_ADC_MULTI_DUAL_INJ_SIMULT       (                     ADC_CCTRL_ADCMSEL_2                       | ADC_CCTRL_ADCMSEL_0) /*!< ADC dual mode enabled: group injected simultaneous */
#define DDL_ADC_MULTI_DUAL_INJ_ALTERN       (ADC_CCTRL_ADCMSEL_3                                            | ADC_CCTRL_ADCMSEL_0) /*!< ADC dual mode enabled: group injected alternate trigger. Works only with external triggers (not internal SW start) */
#define DDL_ADC_MULTI_DUAL_REG_SIM_INJ_SIM  (                                                                 ADC_CCTRL_ADCMSEL_0) /*!< ADC dual mode enabled: Combined group regular simultaneous + group injected simultaneous */
#define DDL_ADC_MULTI_DUAL_REG_SIM_INJ_ALT  (                                           ADC_CCTRL_ADCMSEL_1                      ) /*!< ADC dual mode enabled: Combined group regular simultaneous + group injected alternate trigger */
#define DDL_ADC_MULTI_DUAL_REG_INT_INJ_SIM  (                                           ADC_CCTRL_ADCMSEL_1 | ADC_CCTRL_ADCMSEL_0) /*!< ADC dual mode enabled: Combined group regular interleaved + group injected simultaneous */
#if defined(ADC3)
#define DDL_ADC_MULTI_TRIPLE_REG_SIM_INJ_SIM  (ADC_CCTRL_ADCMSEL_4                                             | ADC_CCTRL_ADCMSEL_0) /*!< ADC triple mode enabled: Combined group regular simultaneous + group injected simultaneous */
#define DDL_ADC_MULTI_TRIPLE_REG_SIM_INJ_ALT  (ADC_CCTRL_ADCMSEL_4                       | ADC_CCTRL_ADCMSEL_1                      ) /*!< ADC triple mode enabled: Combined group regular simultaneous + group injected alternate trigger */
#define DDL_ADC_MULTI_TRIPLE_INJ_SIMULT       (ADC_CCTRL_ADCMSEL_4 | ADC_CCTRL_ADCMSEL_2                       | ADC_CCTRL_ADCMSEL_0) /*!< ADC triple mode enabled: group injected simultaneous */
#define DDL_ADC_MULTI_TRIPLE_REG_SIMULT       (ADC_CCTRL_ADCMSEL_4 | ADC_CCTRL_ADCMSEL_2 | ADC_CCTRL_ADCMSEL_1                      ) /*!< ADC triple mode enabled: group regular simultaneous */
#define DDL_ADC_MULTI_TRIPLE_REG_INTERL       (ADC_CCTRL_ADCMSEL_4 | ADC_CCTRL_ADCMSEL_2 | ADC_CCTRL_ADCMSEL_1 | ADC_CCTRL_ADCMSEL_0) /*!< ADC triple mode enabled: Combined group regular interleaved */
#define DDL_ADC_MULTI_TRIPLE_INJ_ALTERN       (ADC_CCTRL_ADCMSEL_4                                             | ADC_CCTRL_ADCMSEL_0) /*!< ADC triple mode enabled: group injected alternate trigger. Works only with external triggers (not internal SW start) */
#endif /* ADC3 */
#else
#define DDL_ADC_MULTI_INDEPENDENT              0x00000000U                                                                               /*!< ADC dual mode disabled (ADC independent mode) */
#define DDL_ADC_MULTI_DUAL_REG_SIMULT          (                     ADC_CTRL1_DUALMCFG_2 | ADC_CTRL1_DUALMCFG_1                       ) /*!< ADC dual mode enabled: group regular simultaneous */
#define DDL_ADC_MULTI_DUAL_REG_INTERL_FAST     (                     ADC_CTRL1_DUALMCFG_2 | ADC_CTRL1_DUALMCFG_1 | ADC_CTRL1_DUALMCFG_0) /*!< ADC dual mode enabled: Combined group regular interleaved fast (delay between ADC sampling phases: 7 ADC clock cycles) (equivalent to multimode sampling delay set to "LL_ADC_MULTI_TWOSMP_DELAY_7CYCLES" on other APM32 devices)) */
#define DDL_ADC_MULTI_DUAL_REG_INTERL_SLOW     (ADC_CTRL1_DUALMCFG_3                                                                   ) /*!< ADC dual mode enabled: Combined group regular interleaved slow (delay between ADC sampling phases: 14 ADC clock cycles) (equivalent to multimode sampling delay set to "LL_ADC_MULTI_TWOSMP_DELAY_14CYCLES" on other APM32 devices)) */
#define DDL_ADC_MULTI_DUAL_INJ_SIMULT          (                     ADC_CTRL1_DUALMCFG_2                        | ADC_CTRL1_DUALMCFG_0) /*!< ADC dual mode enabled: group injected simultaneous slow (delay between ADC sampling phases: 14 ADC clock cycles) (equivalent to multimode sampling delay set to "LL_ADC_MULTI_TWOSMP_DELAY_14CYCLES" on other APM32 devices)) */
#define DDL_ADC_MULTI_DUAL_INJ_ALTERN          (ADC_CTRL1_DUALMCFG_3                                             | ADC_CTRL1_DUALMCFG_0) /*!< ADC dual mode enabled: group injected alternate trigger. Works only with external triggers (not internal SW start) */
#define DDL_ADC_MULTI_DUAL_REG_SIM_INJ_SIM     (                                                                   ADC_CTRL1_DUALMCFG_0) /*!< ADC dual mode enabled: Combined group regular simultaneous + group injected simultaneous */
#define DDL_ADC_MULTI_DUAL_REG_SIM_INJ_ALT     (                                            ADC_CTRL1_DUALMCFG_1                       ) /*!< ADC dual mode enabled: Combined group regular simultaneous + group injected alternate trigger */
#define DDL_ADC_MULTI_DUAL_REG_INTFAST_INJ_SIM (                                            ADC_CTRL1_DUALMCFG_1 | ADC_CTRL1_DUALMCFG_0) /*!< ADC dual mode enabled: Combined group regular interleaved fast (delay between ADC sampling phases: 7 ADC clock cycles) + group injected simultaneous */
#define DDL_ADC_MULTI_DUAL_REG_INTSLOW_INJ_SIM (                     ADC_CTRL1_DUALMCFG_2                                              ) /*!< ADC dual mode enabled: Combined group regular interleaved slow (delay between ADC sampling phases: 14 ADC clock cycles) + group injected simultaneous */
#endif /* ADC_CCTRL_ADCMSEL */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_MULTI_DMA_TRANSFER  Multimode - DMA transfer
  * @{
  */
#if defined (ADC_CCTRL_DMAMODE)
#define DDL_ADC_MULTI_REG_DMA_EACH_ADC        0x00000000UL                                                          /*!< ADC multimode group regular conversions are transferred by DMA: each ADC uses its own DMA channel, with its individual DMA transfer settings */
#define DDL_ADC_MULTI_REG_DMA_LIMIT_1         (                                                ADC_CCTRL_DMAMODE_0) /*!< ADC multimode group regular conversions are transferred by DMA, one DMA channel for all ADC instances (DMA of ADC master), in limited mode (one shot mode): DMA transfer requests are stopped when number of DMA data transfers (number of ADC conversions) is reached. This ADC mode is intended to be used with DMA mode non-circular. Setting of DMA mode 1: 2 or 3 (dual or triple mode) half-words one by one, ADC1 then ADC2 then ADC3. */
#define DDL_ADC_MULTI_REG_DMA_LIMIT_2         (                          ADC_CCTRL_DMAMODE_1                      ) /*!< ADC multimode group regular conversions are transferred by DMA, one DMA channel for all ADC instances (DMA of ADC master), in limited mode (one shot mode): DMA transfer requests are stopped when number of DMA data transfers (number of ADC conversions) is reached. This ADC mode is intended to be used with DMA mode non-circular. Setting of DMA mode 2: 2 or 3 (dual or triple mode) half-words one by one, ADC2&1 then ADC1&3 then ADC3&2. */
#define DDL_ADC_MULTI_REG_DMA_LIMIT_3         (                          ADC_CCTRL_DMAMODE_1 | ADC_CCTRL_DMAMODE_0) /*!< ADC multimode group regular conversions are transferred by DMA, one DMA channel for all ADC instances (DMA of ADC master), in limited mode (one shot mode): DMA transfer requests are stopped when number of DMA data transfers (number of ADC conversions) is reached. This ADC mode is intended to be used with DMA mode non-circular. Setting of DMA mode 3: 2 or 3 (dual or triple mode) bytes one by one, ADC2&1 then ADC1&3 then ADC3&2. */
#define DDL_ADC_MULTI_REG_DMA_UNLMT_1         (ADC_CCTRL_DMAMODEDISSEL |                       ADC_CCTRL_DMAMODE_0) /*!< ADC multimode group regular conversions are transferred by DMA, one DMA channel for all ADC instances (DMA of ADC master), in unlimited mode: DMA transfer requests are unlimited, whatever number of DMA data transferred (number of ADC conversions) is reached. This ADC mode is intended to be used with DMA mode non-circular. Setting of DMA mode 1: 2 or 3 (dual or triple mode) half-words one by one, ADC1 then ADC2 then ADC3. */
#define DDL_ADC_MULTI_REG_DMA_UNLMT_2         (ADC_CCTRL_DMAMODEDISSEL | ADC_CCTRL_DMAMODE_1                      ) /*!< ADC multimode group regular conversions are transferred by DMA, one DMA channel for all ADC instances (DMA of ADC master), in unlimited mode: DMA transfer requests are unlimited, whatever number of DMA data transferred (number of ADC conversions) is reached. This ADC mode is intended to be used with DMA mode non-circular. Setting of DMA mode 2: 2 or 3 (dual or triple mode) half-words by pairs, ADC2&1 then ADC1&3 then ADC3&2. */
#define DDL_ADC_MULTI_REG_DMA_UNLMT_3         (ADC_CCTRL_DMAMODEDISSEL | ADC_CCTRL_DMAMODE_1 | ADC_CCTRL_DMAMODE_0) /*!< ADC multimode group regular conversions are transferred by DMA, one DMA channel for all ADC instances (DMA of ADC master), in unlimited mode: DMA transfer requests are unlimited, whatever number of DMA data transferred (number of ADC conversions) is reached. This ADC mode is intended to be used with DMA mode non-circular. Setting of DMA mode 3: 2 or 3 (dual or triple mode) bytes one by one, ADC2&1 then ADC1&3 then ADC3&2. */
#endif /* ADC_CCTRL_DMAMODE */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_MULTI_TWOSMP_DELAY  Multimode - Delay between two sampling phases
  * @{
  */
#if defined (ADC_CCTRL_SMPDEL2)
#define DDL_ADC_MULTI_TWOSMP_DELAY_5CYCLES  0x00000000UL                                                                            /*!< ADC multimode delay between two sampling phases: 5 ADC clock cycles*/
#define DDL_ADC_MULTI_TWOSMP_DELAY_6CYCLES  (                                                                  ADC_CCTRL_SMPDEL2_0) /*!< ADC multimode delay between two sampling phases: 6 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_7CYCLES  (                                            ADC_CCTRL_SMPDEL2_1                      ) /*!< ADC multimode delay between two sampling phases: 7 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_8CYCLES  (                                            ADC_CCTRL_SMPDEL2_1 | ADC_CCTRL_SMPDEL2_0) /*!< ADC multimode delay between two sampling phases: 8 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_9CYCLES  (                      ADC_CCTRL_SMPDEL2_2                                            ) /*!< ADC multimode delay between two sampling phases: 9 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_10CYCLES (                      ADC_CCTRL_SMPDEL2_2                       | ADC_CCTRL_SMPDEL2_0) /*!< ADC multimode delay between two sampling phases: 10 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_11CYCLES (                      ADC_CCTRL_SMPDEL2_2 | ADC_CCTRL_SMPDEL2_1                      ) /*!< ADC multimode delay between two sampling phases: 11 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_12CYCLES (                      ADC_CCTRL_SMPDEL2_2 | ADC_CCTRL_SMPDEL2_1 | ADC_CCTRL_SMPDEL2_0) /*!< ADC multimode delay between two sampling phases: 12 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_13CYCLES (ADC_CCTRL_SMPDEL2_3                                                                  ) /*!< ADC multimode delay between two sampling phases: 13 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_14CYCLES (ADC_CCTRL_SMPDEL2_3                                             | ADC_CCTRL_SMPDEL2_0) /*!< ADC multimode delay between two sampling phases: 14 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_15CYCLES (ADC_CCTRL_SMPDEL2_3                       | ADC_CCTRL_SMPDEL2_1                      ) /*!< ADC multimode delay between two sampling phases: 15 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_16CYCLES (ADC_CCTRL_SMPDEL2_3                       | ADC_CCTRL_SMPDEL2_1 | ADC_CCTRL_SMPDEL2_0) /*!< ADC multimode delay between two sampling phases: 16 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_17CYCLES (ADC_CCTRL_SMPDEL2_3 | ADC_CCTRL_SMPDEL2_2                                            ) /*!< ADC multimode delay between two sampling phases: 17 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_18CYCLES (ADC_CCTRL_SMPDEL2_3 | ADC_CCTRL_SMPDEL2_2                       | ADC_CCTRL_SMPDEL2_0) /*!< ADC multimode delay between two sampling phases: 18 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_19CYCLES (ADC_CCTRL_SMPDEL2_3 | ADC_CCTRL_SMPDEL2_2 | ADC_CCTRL_SMPDEL2_1                      ) /*!< ADC multimode delay between two sampling phases: 19 ADC clock cycles */
#define DDL_ADC_MULTI_TWOSMP_DELAY_20CYCLES (ADC_CCTRL_SMPDEL2_3 | ADC_CCTRL_SMPDEL2_2 | ADC_CCTRL_SMPDEL2_1 | ADC_CCTRL_SMPDEL2_0) /*!< ADC multimode delay between two sampling phases: 20 ADC clock cycles */
#endif /* ADC_CCTRL_SMPDEL2 */
/**
  * @}
  */

/** @defgroup ADC_DDL_EC_MULTI_MASTER_SLAVE  Multimode - ADC master or slave
  * @{
  */
#if defined (ADC_CDATA_RDATA_MST)
#define DDL_ADC_MULTI_MASTER                (                      ADC_CDATA_RDATA_MST) /*!< In multimode, selection among several ADC instances: ADC master */
#define DDL_ADC_MULTI_SLAVE                 (ADC_CDATA_RDATA_SLV                      ) /*!< In multimode, selection among several ADC instances: ADC slave */
#define DDL_ADC_MULTI_MASTER_SLAVE          (ADC_CDATA_RDATA_SLV | ADC_CDATA_RDATA_MST) /*!< In multimode, selection among several ADC instances: both ADC master and ADC slave */
#else
#define DDL_ADC_MULTI_MASTER                (                       ADC_REGDATA_REGDATA) /*!< In multimode, selection among several ADC instances: ADC master */
#define DDL_ADC_MULTI_SLAVE                 (ADC_REGDATA_ADC2DATA                      ) /*!< In multimode, selection among several ADC instances: ADC slave */
#define DDL_ADC_MULTI_MASTER_SLAVE          (ADC_REGDATA_ADC2DATA | ADC_REGDATA_REGDATA) /*!< In multimode, selection among several ADC instances: both ADC master and ADC slave */
#endif  /* ADC_CDATA_RDATA_MST */
/**
  * @}
  */

#endif /* ADC_MULTIMODE_SUPPORT */


/** @defgroup ADC_DDL_EC_HW_DELAYS  Definitions of ADC hardware constraints delays
  * @note   Only ADC IP HW delays are defined in ADC LL driver driver,
  *         not timeout values.
  *         For details on delays values, refer to descriptions in source code
  *         above each literal definition.
  * @{
  */

