betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_adc.h
/** @defgroup ADC_DDL_EF_DMA_Management ADC DMA management
  * @{
  */
/* Note: LL ADC functions to set DMA transfer are located into sections of    */
/*       configuration of ADC instance, groups and multimode (if available):  */
/*       @ref DDL_ADC_REG_SetDMATransfer(), ...                                */

/**
  * @brief  Function to help to configure DMA transfer from ADC: retrieve the
  *         ADC register address from ADC instance and a list of ADC registers
  *         intended to be used (most commonly) with DMA transfer.
  * @note   These ADC registers are data registers:
  *         when ADC conversion data is available in ADC data registers,
  *         ADC generates a DMA transfer request.
  * @note   This macro is intended to be used with LL DMA driver, refer to
  *         function "DDL_DMA_ConfigAddresses()".
  *         Example:
  *           DDL_DMA_ConfigAddresses(DMA1,
  *                                  DDL_DMA_CHANNEL_1,
  *                                  DDL_ADC_DMA_GetRegAddr(ADC1, DDL_ADC_DMA_REG_REGULAR_DATA),
  *                                  (uint32_t)&< array or variable >,
  *                                  DDL_DMA_DIRECTION_PERIPH_TO_MEMORY);
  * @note   For devices with several ADC: in multimode, some devices
  *         use a different data register outside of ADC instance scope
  *         (common data register). This macro manages this register difference,
  *         only ADC instance has to be set as parameter.
  * @param  ADCx ADC instance
  * @param  Register This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_DMA_REG_REGULAR_DATA
  *         @arg @ref DDL_ADC_DMA_REG_REGULAR_DATA_MULTI (1)
  *
  *         (1) Available on devices with several ADC instances.
  * @retval ADC register address
  */
#if defined(ADC_MULTIMODE_SUPPORT)
__STATIC_INLINE uint32_t DDL_ADC_DMA_GetRegAddr(ADC_TypeDef *ADCx, uint32_t Register)
{
  uint32_t data_reg_addr = 0UL;

  if (Register == DDL_ADC_DMA_REG_REGULAR_DATA)
  {
    /* Retrieve address of register DR */
    data_reg_addr = (uint32_t)&(ADCx->REGDATA);
  }
  else /* (Register == DDL_ADC_DMA_REG_REGULAR_DATA_MULTI) */
  {
#if defined (ADC_CDATA_DATA1)
    /* Retrieve address of register CDATA */
    data_reg_addr = (uint32_t)&((__DDL_ADC_COMMON_INSTANCE(ADCx))->CDATA);
#else
    /* Retrieve address of register CDATA */
    data_reg_addr = (uint32_t)&((__DDL_ADC_COMMON_INSTANCE(ADCx))->REGDATA);
#endif /* ADC_CDATA_DATA1 */
  }

  return data_reg_addr;
}
#else
__STATIC_INLINE uint32_t DDL_ADC_DMA_GetRegAddr(ADC_TypeDef *ADCx, uint32_t Register)
{
  UNUSED(Register);

  /* Retrieve address of register DR */
  return (uint32_t)&(ADCx->REGDATA);
}
#endif

/**
  * @}
  */

/** @defgroup ADC_DDL_EF_Configuration_ADC_Common Configuration of ADC hierarchical scope: common to several ADC instances
  * @{
  */
#if defined (ADC_CCTRL_ADCPRE)
/**
  * @brief  Set parameter common to several ADC: Clock source and prescaler.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @param  CommonClock This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_CLOCK_SYNC_PCLK_DIV2
  *         @arg @ref DDL_ADC_CLOCK_SYNC_PCLK_DIV4
  *         @arg @ref DDL_ADC_CLOCK_SYNC_PCLK_DIV6
  *         @arg @ref DDL_ADC_CLOCK_SYNC_PCLK_DIV8
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_SetCommonClock(ADC_Common_TypeDef *ADCxy_COMMON, uint32_t CommonClock)
{
  MODIFY_REG(ADCxy_COMMON->CCTRL, ADC_CCTRL_ADCPRE, CommonClock);
}

/**
  * @brief  Get parameter common to several ADC: Clock source and prescaler.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_CLOCK_SYNC_PCLK_DIV2
  *         @arg @ref DDL_ADC_CLOCK_SYNC_PCLK_DIV4
  *         @arg @ref DDL_ADC_CLOCK_SYNC_PCLK_DIV6
  *         @arg @ref DDL_ADC_CLOCK_SYNC_PCLK_DIV8
  */
__STATIC_INLINE uint32_t DDL_ADC_GetCommonClock(ADC_Common_TypeDef *ADCxy_COMMON)
{
  return (uint32_t)(READ_BIT(ADCxy_COMMON->CCTRL, ADC_CCTRL_ADCPRE));
}
#endif /* ADC_CCTRL_ADCPRE */

/**
  * @brief  Set parameter common to several ADC: measurement path to internal
  *         channels (VrefInt, temperature sensor, ...).
  * @note   One or several values can be selected.
  *         Example: (DDL_ADC_PATH_INTERNAL_VREFINT |
  *                   DDL_ADC_PATH_INTERNAL_TEMPSENSOR)
  * @note   Stabilization time of measurement path to internal channel:
  *         After enabling internal paths, before starting ADC conversion,
  *         a delay is required for internal voltage reference and
  *         temperature sensor stabilization time.
  *         Refer to device datasheet.
  *         Refer to literal @ref DDL_ADC_DELAY_VREFINT_STAB_US.
  *         Refer to literal @ref DDL_ADC_DELAY_TEMPSENSOR_STAB_US.
  * @note   ADC internal channel sampling time constraint:
  *         For ADC conversion of internal channels,
  *         a sampling time minimum value is required.
  *         Refer to device datasheet.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @param  PathInternal This parameter can be a combination of the following values:
  *         @arg @ref DDL_ADC_PATH_INTERNAL_NONE
  *         @arg @ref DDL_ADC_PATH_INTERNAL_VREFINT
  *         @arg @ref DDL_ADC_PATH_INTERNAL_TEMPSENSOR
  *         @arg @ref DDL_ADC_PATH_INTERNAL_VBAT        (1)
  *
  *         (1) On APM32F402/403xx, this paramer is invalid. /n
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_SetCommonPathInternalCh(ADC_Common_TypeDef *ADCxy_COMMON, uint32_t PathInternal)
{
#if defined (ADC_CCTRL_VBATEN)
  MODIFY_REG(ADCxy_COMMON->CCTRL, ADC_CCTRL_TSVREFEN | ADC_CCTRL_VBATEN, PathInternal);
#else
  MODIFY_REG(ADCxy_COMMON->CTRL2, ADC_CTRL2_TSVREFEN, PathInternal);
#endif  /* ADC_CCTRL_VBATEN */
}

/**
  * @brief  Get parameter common to several ADC: measurement path to internal
  *         channels (VrefInt, temperature sensor, ...).
  * @note   One or several values can be selected.
  *         Example: (DDL_ADC_PATH_INTERNAL_VREFINT |
  *                   DDL_ADC_PATH_INTERNAL_TEMPSENSOR)
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref DDL_ADC_PATH_INTERNAL_NONE
  *         @arg @ref DDL_ADC_PATH_INTERNAL_VREFINT
  *         @arg @ref DDL_ADC_PATH_INTERNAL_TEMPSENSOR
  *         @arg @ref DDL_ADC_PATH_INTERNAL_VBAT
  */
__STATIC_INLINE uint32_t DDL_ADC_GetCommonPathInternalCh(ADC_Common_TypeDef *ADCxy_COMMON)
{
#if defined (ADC_CCTRL_VBATEN)
  return (uint32_t)(READ_BIT(ADCxy_COMMON->CCTRL, ADC_CCTRL_TSVREFEN | ADC_CCTRL_VBATEN));
#else
  return (uint32_t)(READ_BIT(ADCxy_COMMON->CTRL2, ADC_CTRL2_TSVREFEN));
#endif  /* ADC_CCTRL_VBATEN */
}

/**
  * @}
  */

/** @defgroup ADC_DDL_EF_Configuration_ADC_Instance Configuration of ADC hierarchical scope: ADC instance
  * @{
  */
#if defined (ADC_CTRL1_RESSEL)
/**
  * @brief  Set ADC resolution.
  *         Refer to reference manual for alignments formats
  *         dependencies to ADC resolutions.
  * @param  ADCx ADC instance
  * @param  Resolution This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_RESOLUTION_12B
  *         @arg @ref DDL_ADC_RESOLUTION_10B
  *         @arg @ref DDL_ADC_RESOLUTION_8B
  *         @arg @ref DDL_ADC_RESOLUTION_6B
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_SetResolution(ADC_TypeDef *ADCx, uint32_t Resolution)
{
  MODIFY_REG(ADCx->CTRL1, ADC_CTRL1_RESSEL, Resolution);
}

/**
  * @brief  Get ADC resolution.
  *         Refer to reference manual for alignments formats
  *         dependencies to ADC resolutions.
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_RESOLUTION_12B
  *         @arg @ref DDL_ADC_RESOLUTION_10B
  *         @arg @ref DDL_ADC_RESOLUTION_8B
  *         @arg @ref DDL_ADC_RESOLUTION_6B
  */
__STATIC_INLINE uint32_t DDL_ADC_GetResolution(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CTRL1, ADC_CTRL1_RESSEL));
}
#endif /* ADC_CTRL1_RESSEL */

/**
  * @brief  Set ADC conversion data alignment.
  * @note   Refer to reference manual for alignments formats
  *         dependencies to ADC resolutions.
  * @param  ADCx ADC instance
  * @param  DataAlignment This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_DATA_ALIGN_RIGHT
  *         @arg @ref DDL_ADC_DATA_ALIGN_LEFT
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_SetDataAlignment(ADC_TypeDef *ADCx, uint32_t DataAlignment)
{
  MODIFY_REG(ADCx->CTRL2, ADC_CTRL2_DALIGNCFG, DataAlignment);
}

/**
  * @brief  Get ADC conversion data alignment.
  * @note   Refer to reference manual for alignments formats
  *         dependencies to ADC resolutions.
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_DATA_ALIGN_RIGHT
  *         @arg @ref DDL_ADC_DATA_ALIGN_LEFT
  */
__STATIC_INLINE uint32_t DDL_ADC_GetDataAlignment(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CTRL2, ADC_CTRL2_DALIGNCFG));
}

/**
  * @brief  Set ADC sequencers scan mode, for all ADC groups
  *         (group regular, group injected).
  * @note  According to sequencers scan mode :
  *         - If disabled: ADC conversion is performed in unitary conversion
  *           mode (one channel converted, that defined in rank 1).
  *           Configuration of sequencers of all ADC groups
  *           (sequencer scan length, ...) is discarded: equivalent to
  *           scan length of 1 rank.
  *         - If enabled: ADC conversions are performed in sequence conversions
  *           mode, according to configuration of sequencers of
  *           each ADC group (sequencer scan length, ...).
  *           Refer to function @ref DDL_ADC_REG_SetSequencerLength()
  *           and to function @ref DDL_ADC_INJ_SetSequencerLength().
  * @param  ADCx ADC instance
  * @param  ScanMode This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_SEQ_SCAN_DISABLE
  *         @arg @ref DDL_ADC_SEQ_SCAN_ENABLE
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_SetSequencersScanMode(ADC_TypeDef *ADCx, uint32_t ScanMode)
{
  MODIFY_REG(ADCx->CTRL1, ADC_CTRL1_SCANEN, ScanMode);
}

/**
  * @brief  Get ADC sequencers scan mode, for all ADC groups
  *         (group regular, group injected).
  * @note  According to sequencers scan mode :
  *         - If disabled: ADC conversion is performed in unitary conversion
  *           mode (one channel converted, that defined in rank 1).
  *           Configuration of sequencers of all ADC groups
  *           (sequencer scan length, ...) is discarded: equivalent to
  *           scan length of 1 rank.
  *         - If enabled: ADC conversions are performed in sequence conversions
  *           mode, according to configuration of sequencers of
  *           each ADC group (sequencer scan length, ...).
  *           Refer to function @ref DDL_ADC_REG_SetSequencerLength()
  *           and to function @ref DDL_ADC_INJ_SetSequencerLength().
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_SEQ_SCAN_DISABLE
  *         @arg @ref DDL_ADC_SEQ_SCAN_ENABLE
  */
__STATIC_INLINE uint32_t DDL_ADC_GetSequencersScanMode(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CTRL1, ADC_CTRL1_SCANEN));
}

/**
  * @}
  */

/** @defgroup ADC_DDL_EF_Configuration_ADC_Group_Regular Configuration of ADC hierarchical scope: group regular
  * @{
  */

/**
  * @brief  Set ADC group regular conversion trigger source:
  *         internal (SW start) or from external IP (timer event,
  *         external interrupt line).
  * @note   On this APM32 series, setting of external trigger edge is performed
  *         using function @ref DDL_ADC_REG_StartConversionExtTrig().
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  * @param  ADCx ADC instance
  * @param  TriggerSource This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_REG_TRIG_SOFTWARE         (1)(2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR1_CH1     (1)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR1_CH2     (1)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR1_CH3     (1)(2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR2_CH2     (1)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR2_CH3     (2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR2_CH4
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR2_TRGO
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR3_CH1     (2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR3_TRGO    (1)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR4_CH4     (1)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR5_CH1     (2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR5_CH2
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR5_CH3     (2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR8_CH1     (2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR8_TRGO    (2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_EINT_LINE11  (1)
  *
  *         (1) On APM32F402/403xx, parameter available only on ADC instances: ADC1, ADC2 (for ADC instances ADCx available on the selected device).\n
  *         (2) On APM32F402/403xx, parameter available only on ADC instances: ADC3 (for ADC instances ADCx available on the selected device).\n
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_REG_SetTriggerSource(ADC_TypeDef *ADCx, uint32_t TriggerSource)
{
/* Note: On this APM32 series, ADC group regular external trigger edge        */
/*       is used to perform a ADC conversion start.                           */
/*       This function does not set external trigger edge.                    */
/*       This feature is set using function                                   */
/*       @ref DDL_ADC_REG_StartConversionExtTrig().                            */
  MODIFY_REG(ADCx->CTRL2, ADC_CTRL2_REGEXTTRGSEL, (TriggerSource & ADC_CTRL2_REGEXTTRGSEL));
}

/**
  * @brief  Get ADC group regular conversion trigger source:
  *         internal (SW start) or from external IP (timer event,
  *         external interrupt line).
  * @note   To determine whether group regular trigger source is
  *         internal (SW start) or external, without detail
  *         of which peripheral is selected as external trigger,
  *         (equivalent to
  *         "if(DDL_ADC_REG_GetTriggerSource(ADC1) == DDL_ADC_REG_TRIG_SOFTWARE)")
  *         use function @ref DDL_ADC_REG_IsTriggerSourceSWStart.
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_REG_TRIG_SOFTWARE         (1)(2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR1_CH1     (1)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR1_CH2     (1)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR1_CH3     (1)(2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR2_CH2     (1)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR2_CH3     (2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR2_CH4
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR2_TRGO
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR3_CH1     (2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR3_TRGO    (1)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR4_CH4     (1)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR5_CH1     (2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR5_CH2
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR5_CH3     (2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR8_CH1     (2)
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_TMR8_TRGO
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_EINT_LINE11  (1)
  *
  *         (1) On APM32F402/403xx, parameter available only on ADC instances: ADC1, ADC2 (for ADC instances ADCx available on the selected device).\n
  *         (2) On APM32F402/403xx, parameter available only on ADC instances: ADC3 (for ADC instances ADCx available on the selected device).\n
  */
__STATIC_INLINE uint32_t DDL_ADC_REG_GetTriggerSource(ADC_TypeDef *ADCx)
{
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx)|| defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  uint32_t TriggerSource = READ_BIT(ADCx->CTRL2, ADC_CTRL2_REGEXTTRGSEL | ADC_CTRL2_REGEXTTRGEN);

  /* Value for shift of {0; 4; 8; 12} depending on value of bitfield          */
  /* corresponding to ADC_CTRL2_REGEXTTRGEN {0; 1; 2; 3}.                             */
  uint32_t ShiftExten = ((TriggerSource & ADC_CTRL2_REGEXTTRGEN) >> (ADC_REG_TRIG_EXTEN_BITOFFSET_POS - 2UL));

  /* Set bitfield corresponding to ADC_CTRL2_REGEXTTRGEN and ADC_CTRL2_REGEXTTRGSEL           */
  /* to match with triggers literals definition.                              */
  return ((TriggerSource
           & (ADC_REG_TRIG_SOURCE_MASK << ShiftExten) & ADC_CTRL2_REGEXTTRGSEL)
          | ((ADC_REG_TRIG_EDGE_MASK << ShiftExten) & ADC_CTRL2_REGEXTTRGEN)
         );
#elif defined (APM32F403xx) || defined (APM32F402xx)
  return (uint32_t)(READ_BIT(ADCx->CTRL2, ADC_CTRL2_REGEXTTRGSEL));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
}

/**
  * @brief  Get ADC group regular conversion trigger source internal (SW start)
            or external.
  * @note   In case of group regular trigger source set to external trigger,
  *         to determine which peripheral is selected as external trigger,
  *         use function @ref DDL_ADC_REG_GetTriggerSource().
  * @param  ADCx ADC instance
  * @retval Value "0" if trigger source external trigger
  *         Value "1" if trigger source SW start.
  */
__STATIC_INLINE uint32_t DDL_ADC_REG_IsTriggerSourceSWStart(ADC_TypeDef *ADCx)
{
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  return (READ_BIT(ADCx->CTRL2, ADC_CTRL2_REGEXTTRGEN) == (DDL_ADC_REG_TRIG_SOFTWARE & ADC_CTRL2_REGEXTTRGEN));
#elif defined (APM32F403xx) || defined (APM32F402xx)
  return (READ_BIT(ADCx->CTRL2, ADC_CTRL2_REGEXTTRGSEL) == (DDL_ADC_REG_TRIG_SOFTWARE & ADC_CTRL2_REGEXTTRGSEL));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
}

#if defined(ADC_CTRL2_REGEXTTRGEN_1)
/**
  * @brief  Get ADC group regular conversion trigger polarity.
  * @note   Applicable only for trigger source set to external trigger.
  * @note   On this APM32 series, setting of external trigger edge is performed
  *         using function @ref DDL_ADC_REG_StartConversionExtTrig().
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_RISING
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_FALLING
  *         @arg @ref DDL_ADC_REG_TRIG_EXT_RISINGFALLING
  */
__STATIC_INLINE uint32_t DDL_ADC_REG_GetTriggerEdge(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CTRL2, ADC_CTRL2_REGEXTTRGEN));
}
#endif /* ADC_CTRL2_REGEXTTRGEN_1 */

/**
  * @brief  Set ADC group regular sequencer length and scan direction.
  * @note   Description of ADC group regular sequencer features:
  *         - For devices with sequencer fully configurable
  *           (function "DDL_ADC_REG_SetSequencerRanks()" available):
  *           sequencer length and each rank affectation to a channel
  *           are configurable.
  *           This function performs configuration of:
  *           - Sequence length: Number of ranks in the scan sequence.
  *           - Sequence direction: Unless specified in parameters, sequencer
  *             scan direction is forward (from rank 1 to rank n).
  *           Sequencer ranks are selected using
  *           function "DDL_ADC_REG_SetSequencerRanks()".
  *         - For devices with sequencer not fully configurable
  *           (function "DDL_ADC_REG_SetSequencerChannels()" available):
  *           sequencer length and each rank affectation to a channel
  *           are defined by channel number.
  *           This function performs configuration of:
  *           - Sequence length: Number of ranks in the scan sequence is
  *             defined by number of channels set in the sequence,
  *             rank of each channel is fixed by channel HW number.
  *             (channel 0 fixed on rank 0, channel 1 fixed on rank1, ...).
  *           - Sequence direction: Unless specified in parameters, sequencer
  *             scan direction is forward (from lowest channel number to
  *             highest channel number).
  *           Sequencer ranks are selected using
  *           function "DDL_ADC_REG_SetSequencerChannels()".
  * @note   On this APM32 series, group regular sequencer configuration
  *         is conditioned to ADC instance sequencer mode.
  *         If ADC instance sequencer mode is disabled, sequencers of
  *         all groups (group regular, group injected) can be configured
  *         but their execution is disabled (limited to rank 1).
  *         Refer to function @ref DDL_ADC_SetSequencersScanMode().
  * @note   Sequencer disabled is equivalent to sequencer of 1 rank:
  *         ADC conversion on only 1 channel.
  * @param  ADCx ADC instance
  * @param  SequencerNbRanks This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_DISABLE
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_5RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_6RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_7RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_8RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_9RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_10RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_11RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_12RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_13RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_14RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_15RANKS
  *         @arg @ref DDL_ADC_REG_SEQ_SCAN_ENABLE_16RANKS
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_REG_SetSequencerLength(ADC_TypeDef *ADCx, uint32_t SequencerNbRanks)
{
  MODIFY_REG(ADCx->REGSEQ1, ADC_REGSEQ1_REGSEQLEN, SequencerNbRanks);
}

