betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_adc.h
#if defined (ADC_CTRL2_EOCSEL)
/**
  * @brief  Specify which ADC flag between EOC (end of unitary conversion)
  *         or EOS (end of sequence conversions) is used to indicate
  *         the end of conversion.
  * @note   This feature is aimed to be set when using ADC with
  *         programming model by polling or interruption
  *         (programming model by DMA usually uses DMA interruptions
  *         to indicate end of conversion and data transfer).
  * @note   For ADC group injected, end of conversion (flag&IT) is raised
  *         only at the end of the sequence.
  * @param  ADCx ADC instance
  * @param  EocSelection This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_REG_FLAG_EOC_SEQUENCE_CONV
  *         @arg @ref DDL_ADC_REG_FLAG_EOC_UNITARY_CONV
  * @retval None
  *
  */
__STATIC_INLINE void DDL_ADC_REG_SetFlagEndOfConversion(ADC_TypeDef *ADCx, uint32_t EocSelection)
{
  MODIFY_REG(ADCx->CTRL2, ADC_CTRL2_EOCSEL, EocSelection);
}

/**
  * @brief  Get which ADC flag between EOC (end of unitary conversion)
  *         or EOS (end of sequence conversions) is used to indicate
  *         the end of conversion.
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_REG_FLAG_EOC_SEQUENCE_CONV
  *         @arg @ref DDL_ADC_REG_FLAG_EOC_UNITARY_CONV
  */
__STATIC_INLINE uint32_t DDL_ADC_REG_GetFlagEndOfConversion(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CTRL2, ADC_CTRL2_EOCSEL));
}
#endif /* ADC_CTRL2_EOCSEL */

/**
  * @}
  */

/** @defgroup ADC_DDL_EF_Configuration_ADC_Group_Injected Configuration of ADC hierarchical scope: group injected
  * @{
  */

/**
  * @brief  Set ADC group injected conversion trigger source:
  *         internal (SW start) or from external IP (timer event,
  *         external interrupt line).
  * @note   On this APM32 series, setting of external trigger edge is performed
  *         using function @ref DDL_ADC_INJ_StartConversionExtTrig().
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  * @param  ADCx ADC instance
  * @param  TriggerSource This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_TRIG_SOFTWARE         (1)(2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR1_CH4     (1)(2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR1_TRGO    (1)(2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR2_CH1     (1)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR2_TRGO    (1)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR3_CH2
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR3_CH4     (1)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR4_CH1
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR4_CH2
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR4_CH3     (2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR4_TRGO    (1)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR5_CH4     (2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR5_TRGO    (2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR8_CH2     (2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR8_CH3
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR8_CH4     (2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_EXTI_LINE15  (1)
  *
  *         (1) On APM32F402/403xx, parameter available only on ADC instances: ADC1, ADC2 (for ADC instances ADCx available on the selected device).\n
  *         (2) On APM32F402/403xx, parameter available only on ADC instances: ADC3 (for ADC instances ADCx available on the selected device).\n
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_INJ_SetTriggerSource(ADC_TypeDef *ADCx, uint32_t TriggerSource)
{
/* Note: On this APM32 series, ADC group injected external trigger edge       */
/*       is used to perform a ADC conversion start.                           */
/*       This function does not set external trigger edge.                    */
/*       This feature is set using function                                   */
/*       @ref DDL_ADC_INJ_StartConversionExtTrig().                            */
  MODIFY_REG(ADCx->CTRL2, ADC_CTRL2_INJGEXTTRGSEL, (TriggerSource & ADC_CTRL2_INJGEXTTRGSEL));
}

/**
  * @brief  Get ADC group injected conversion trigger source:
  *         internal (SW start) or from external IP (timer event,
  *         external interrupt line).
  * @note   To determine whether group injected trigger source is
  *         internal (SW start) or external, without detail
  *         of which peripheral is selected as external trigger,
  *         (equivalent to
  *         "if(DDL_ADC_INJ_GetTriggerSource(ADC1) == DDL_ADC_INJ_TRIG_SOFTWARE)")
  *         use function @ref DDL_ADC_INJ_IsTriggerSourceSWStart.
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_TRIG_SOFTWARE         (1)(2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR1_CH4     (1)(2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR1_TRGO    (1)(2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR2_CH1     (1)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR2_TRGO    (1)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR3_CH2
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR3_CH4     (1)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR4_CH1
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR4_CH2
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR4_CH3     (2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR4_TRGO    (1)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR5_CH4     (2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR5_TRGO    (2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR8_CH2     (2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR8_CH3
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_TMR8_CH4     (2)
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_EXTI_LINE15  (1)
  *
  *         (1) On APM32F402/403xx, parameter available only on ADC instances: ADC1, ADC2 (for ADC instances ADCx available on the selected device).\n
  *         (2) On APM32F402/403xx, parameter available only on ADC instances: ADC3 (for ADC instances ADCx available on the selected device).\n
  */
__STATIC_INLINE uint32_t DDL_ADC_INJ_GetTriggerSource(ADC_TypeDef *ADCx)
{
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  uint32_t TriggerSource = READ_BIT(ADCx->CTRL2, ADC_CTRL2_INJGEXTTRGSEL | ADC_CTRL2_INJEXTTRGEN);

  /* Value for shift of {0; 4; 8; 12} depending on value of bitfield          */
  /* corresponding to ADC_CTRL2_INJEXTTRGEN {0; 1; 2; 3}.                            */
  uint32_t ShiftExten = ((TriggerSource & ADC_CTRL2_INJEXTTRGEN) >> (ADC_INJ_TRIG_EXTEN_BITOFFSET_POS - 2UL));

  /* Set bitfield corresponding to ADC_CTRL2_INJEXTTRGEN and ADC_CTRL2_INJGEXTTRGSEL         */
  /* to match with triggers literals definition.                              */
  return ((TriggerSource
           & (ADC_INJ_TRIG_SOURCE_MASK << ShiftExten) & ADC_CTRL2_INJGEXTTRGSEL)
          | ((ADC_INJ_TRIG_EDGE_MASK << ShiftExten) & ADC_CTRL2_INJEXTTRGEN)
         );
#elif defined (APM32F403xx) || defined (APM32F402xx)
  return (uint32_t)(READ_BIT(ADCx->CTRL2, ADC_CTRL2_INJGEXTTRGSEL));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
}

/**
  * @brief  Get ADC group injected conversion trigger source internal (SW start)
            or external
  * @note   In case of group injected trigger source set to external trigger,
  *         to determine which peripheral is selected as external trigger,
  *         use function @ref DDL_ADC_INJ_GetTriggerSource.
  * @param  ADCx ADC instance
  * @retval Value "0" if trigger source external trigger
  *         Value "1" if trigger source SW start.
  */
__STATIC_INLINE uint32_t DDL_ADC_INJ_IsTriggerSourceSWStart(ADC_TypeDef *ADCx)
{
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  return (READ_BIT(ADCx->CTRL2, ADC_CTRL2_INJEXTTRGEN) == (DDL_ADC_INJ_TRIG_SOFTWARE & ADC_CTRL2_INJEXTTRGEN));
#elif defined (APM32F403xx) || defined (APM32F402xx)
  return (READ_BIT(ADCx->CTRL2, ADC_CTRL2_INJGEXTTRGSEL) == (DDL_ADC_INJ_TRIG_SOFTWARE & ADC_CTRL2_INJGEXTTRGSEL));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
}

#if defined(ADC_CTRL2_INJEXTTRGEN_1)
/**
  * @brief  Get ADC group injected conversion trigger polarity.
  *         Applicable only for trigger source set to external trigger.
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_RISING
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_FALLING
  *         @arg @ref DDL_ADC_INJ_TRIG_EXT_RISINGFALLING
  */
__STATIC_INLINE uint32_t DDL_ADC_INJ_GetTriggerEdge(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CTRL2, ADC_CTRL2_INJEXTTRGEN));
}
#endif /* ADC_CTRL2_INJEXTTRGEN_1 */

/**
  * @brief  Set ADC group injected sequencer length and scan direction.
  * @note   This function performs configuration of:
  *         - Sequence length: Number of ranks in the scan sequence.
  *         - Sequence direction: Unless specified in parameters, sequencer
  *           scan direction is forward (from rank 1 to rank n).
  * @note   On this APM32 series, group injected sequencer configuration
  *         is conditioned to ADC instance sequencer mode.
  *         If ADC instance sequencer mode is disabled, sequencers of
  *         all groups (group regular, group injected) can be configured
  *         but their execution is disabled (limited to rank 1).
  *         Refer to function @ref DDL_ADC_SetSequencersScanMode().
  * @note   Sequencer disabled is equivalent to sequencer of 1 rank:
  *         ADC conversion on only 1 channel.
  * @param  ADCx ADC instance
  * @param  SequencerNbRanks This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_SEQ_SCAN_DISABLE
  *         @arg @ref DDL_ADC_INJ_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref DDL_ADC_INJ_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref DDL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_INJ_SetSequencerLength(ADC_TypeDef *ADCx, uint32_t SequencerNbRanks)
{
  MODIFY_REG(ADCx->INJSEQ, ADC_INJSEQ_INJSEQLEN, SequencerNbRanks);
}

/**
  * @brief  Get ADC group injected sequencer length and scan direction.
  * @note   This function retrieves:
  *         - Sequence length: Number of ranks in the scan sequence.
  *         - Sequence direction: Unless specified in parameters, sequencer
  *           scan direction is forward (from rank 1 to rank n).
  * @note   On this APM32 series, group injected sequencer configuration
  *         is conditioned to ADC instance sequencer mode.
  *         If ADC instance sequencer mode is disabled, sequencers of
  *         all groups (group regular, group injected) can be configured
  *         but their execution is disabled (limited to rank 1).
  *         Refer to function @ref DDL_ADC_SetSequencersScanMode().
  * @note   Sequencer disabled is equivalent to sequencer of 1 rank:
  *         ADC conversion on only 1 channel.
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_SEQ_SCAN_DISABLE
  *         @arg @ref DDL_ADC_INJ_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref DDL_ADC_INJ_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref DDL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS
  */
__STATIC_INLINE uint32_t DDL_ADC_INJ_GetSequencerLength(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->INJSEQ, ADC_INJSEQ_INJSEQLEN));
}

/**
  * @brief  Set ADC group injected sequencer discontinuous mode:
  *         sequence subdivided and scan conversions interrupted every selected
  *         number of ranks.
  * @note   It is not possible to enable both ADC group injected
  *         auto-injected mode and sequencer discontinuous mode.
  * @param  ADCx ADC instance
  * @param  SeqDiscont This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_SEQ_DISCONT_DISABLE
  *         @arg @ref DDL_ADC_INJ_SEQ_DISCONT_1RANK
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_INJ_SetSequencerDiscont(ADC_TypeDef *ADCx, uint32_t SeqDiscont)
{
  MODIFY_REG(ADCx->CTRL1, ADC_CTRL1_INJDISCEN, SeqDiscont);
}

/**
  * @brief  Get ADC group injected sequencer discontinuous mode:
  *         sequence subdivided and scan conversions interrupted every selected
  *         number of ranks.
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_SEQ_DISCONT_DISABLE
  *         @arg @ref DDL_ADC_INJ_SEQ_DISCONT_1RANK
  */
__STATIC_INLINE uint32_t DDL_ADC_INJ_GetSequencerDiscont(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CTRL1, ADC_CTRL1_INJDISCEN));
}

/**
  * @brief  Set ADC group injected sequence: channel on the selected
  *         sequence rank.
  * @note   Depending on devices and packages, some channels may not be available.
  *         Refer to device datasheet for channels availability.
  * @note   On this APM32 series, to measure internal channels (VrefInt,
  *         TempSensor, ...), measurement paths to internal channels must be
  *         enabled separately.
  *         This can be done using function @ref DDL_ADC_SetCommonPathInternalCh().
  * @param  ADCx ADC instance
  * @param  Rank This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_RANK_1
  *         @arg @ref DDL_ADC_INJ_RANK_2
  *         @arg @ref DDL_ADC_INJ_RANK_3
  *         @arg @ref DDL_ADC_INJ_RANK_4
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_CHANNEL_0
  *         @arg @ref DDL_ADC_CHANNEL_1
  *         @arg @ref DDL_ADC_CHANNEL_2
  *         @arg @ref DDL_ADC_CHANNEL_3
  *         @arg @ref DDL_ADC_CHANNEL_4
  *         @arg @ref DDL_ADC_CHANNEL_5
  *         @arg @ref DDL_ADC_CHANNEL_6
  *         @arg @ref DDL_ADC_CHANNEL_7
  *         @arg @ref DDL_ADC_CHANNEL_8
  *         @arg @ref DDL_ADC_CHANNEL_9
  *         @arg @ref DDL_ADC_CHANNEL_10
  *         @arg @ref DDL_ADC_CHANNEL_11
  *         @arg @ref DDL_ADC_CHANNEL_12
  *         @arg @ref DDL_ADC_CHANNEL_13
  *         @arg @ref DDL_ADC_CHANNEL_14
  *         @arg @ref DDL_ADC_CHANNEL_15
  *         @arg @ref DDL_ADC_CHANNEL_16
  *         @arg @ref DDL_ADC_CHANNEL_17
  *         @arg @ref DDL_ADC_CHANNEL_18           (2)
  *         @arg @ref DDL_ADC_CHANNEL_VREFINT      (1)
  *         @arg @ref DDL_ADC_CHANNEL_TEMPSENSOR   (1)
  *         @arg @ref DDL_ADC_CHANNEL_VBAT         (1)(2)
  *
  *         (1) On APM32F4, parameter available only on ADC instance: ADC1.\n
  *         (2) This parameter is not available for APM32F402/403xx.\n
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_INJ_SetSequencerRanks(ADC_TypeDef *ADCx, uint32_t Rank, uint32_t Channel)
{
  /* Set bits with content of parameter "Channel" with bits position          */
  /* in register depending on parameter "Rank".                               */
  /* Parameters "Rank" and "Channel" are used with masks because containing   */
  /* other bits reserved for other purpose.                                   */
  uint32_t tmpreg1 = (READ_BIT(ADCx->INJSEQ, ADC_INJSEQ_INJSEQLEN) >> ADC_INJSEQ_INJSEQLEN_Pos) + 1UL;

  MODIFY_REG(ADCx->INJSEQ,
             ADC_CHANNEL_ID_NUMBER_MASK << (5UL * (uint8_t)(((Rank) + 3UL) - (tmpreg1))),
             (Channel & ADC_CHANNEL_ID_NUMBER_MASK) << (5UL * (uint8_t)(((Rank) + 3UL) - (tmpreg1))));
}

/**
  * @brief  Get ADC group injected sequence: channel on the selected
  *         sequence rank.
  * @note   Depending on devices and packages, some channels may not be available.
  *         Refer to device datasheet for channels availability.
  * @note   Usage of the returned channel number:
  *         - To reinject this channel into another function DDL_ADC_xxx:
  *           the returned channel number is only partly formatted on definition
  *           of literals DDL_ADC_CHANNEL_x. Therefore, it has to be compared
  *           with parts of literals DDL_ADC_CHANNEL_x or using
  *           helper macro @ref __DDL_ADC_CHANNEL_TO_DECIMAL_NB().
  *           Then the selected literal DDL_ADC_CHANNEL_x can be used
  *           as parameter for another function.
  *         - To get the channel number in decimal format:
  *           process the returned value with the helper macro
  *           @ref __DDL_ADC_CHANNEL_TO_DECIMAL_NB().
  * @param  ADCx ADC instance
  * @param  Rank This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_RANK_1
  *         @arg @ref DDL_ADC_INJ_RANK_2
  *         @arg @ref DDL_ADC_INJ_RANK_3
  *         @arg @ref DDL_ADC_INJ_RANK_4
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_CHANNEL_0
  *         @arg @ref DDL_ADC_CHANNEL_1
  *         @arg @ref DDL_ADC_CHANNEL_2
  *         @arg @ref DDL_ADC_CHANNEL_3
  *         @arg @ref DDL_ADC_CHANNEL_4
  *         @arg @ref DDL_ADC_CHANNEL_5
  *         @arg @ref DDL_ADC_CHANNEL_6
  *         @arg @ref DDL_ADC_CHANNEL_7
  *         @arg @ref DDL_ADC_CHANNEL_8
  *         @arg @ref DDL_ADC_CHANNEL_9
  *         @arg @ref DDL_ADC_CHANNEL_10
  *         @arg @ref DDL_ADC_CHANNEL_11
  *         @arg @ref DDL_ADC_CHANNEL_12
  *         @arg @ref DDL_ADC_CHANNEL_13
  *         @arg @ref DDL_ADC_CHANNEL_14
  *         @arg @ref DDL_ADC_CHANNEL_15
  *         @arg @ref DDL_ADC_CHANNEL_16
  *         @arg @ref DDL_ADC_CHANNEL_17
  *         @arg @ref DDL_ADC_CHANNEL_18
  *         @arg @ref DDL_ADC_CHANNEL_VREFINT      (1)
  *         @arg @ref DDL_ADC_CHANNEL_TEMPSENSOR   (1)
  *         @arg @ref DDL_ADC_CHANNEL_VBAT         (1)
  *
  *         (1) On APM32F4, parameter available only on ADC instance: ADC1.\n
  *         (1) For ADC channel read back from ADC register,
  *             comparison with internal channel parameter to be done
  *             using helper macro @ref __DDL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL().
  */
__STATIC_INLINE uint32_t DDL_ADC_INJ_GetSequencerRanks(ADC_TypeDef *ADCx, uint32_t Rank)
{
  uint32_t tmpreg1 = (READ_BIT(ADCx->INJSEQ, ADC_INJSEQ_INJSEQLEN) >> ADC_INJSEQ_INJSEQLEN_Pos)  + 1UL;

