betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_adc.h
  return (uint32_t)(READ_BIT(ADCx->INJSEQ,
                             ADC_CHANNEL_ID_NUMBER_MASK << (5UL * (uint8_t)(((Rank) + 3UL) - (tmpreg1))))
                    >> (5UL * (uint8_t)(((Rank) + 3UL) - (tmpreg1)))
                   );
}

/**
  * @brief  Set ADC group injected conversion trigger:
  *         independent or from ADC group regular.
  * @note   This mode can be used to extend number of data registers
  *         updated after one ADC conversion trigger and with data
  *         permanently kept (not erased by successive conversions of scan of
  *         ADC sequencer ranks), up to 5 data registers:
  *         1 data register on ADC group regular, 4 data registers
  *         on ADC group injected.
  * @note   If ADC group injected injected trigger source is set to an
  *         external trigger, this feature must be must be set to
  *         independent trigger.
  *         ADC group injected automatic trigger is compliant only with
  *         group injected trigger source set to SW start, without any
  *         further action on  ADC group injected conversion start or stop:
  *         in this case, ADC group injected is controlled only
  *         from ADC group regular.
  * @note   It is not possible to enable both ADC group injected
  *         auto-injected mode and sequencer discontinuous mode.
  * @param  ADCx ADC instance
  * @param  TrigAuto This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_TRIG_INDEPENDENT
  *         @arg @ref DDL_ADC_INJ_TRIG_FROM_GRP_REGULAR
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_INJ_SetTrigAuto(ADC_TypeDef *ADCx, uint32_t TrigAuto)
{
  MODIFY_REG(ADCx->CTRL1, ADC_CTRL1_INJGACEN, TrigAuto);
}

/**
  * @brief  Get ADC group injected conversion trigger:
  *         independent or from ADC group regular.
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_TRIG_INDEPENDENT
  *         @arg @ref DDL_ADC_INJ_TRIG_FROM_GRP_REGULAR
  */
__STATIC_INLINE uint32_t DDL_ADC_INJ_GetTrigAuto(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CTRL1, ADC_CTRL1_INJGACEN));
}

/**
  * @brief  Set ADC group injected offset.
  * @note   It sets:
  *         - ADC group injected rank to which the offset programmed
  *           will be applied
  *         - Offset level (offset to be subtracted from the raw
  *           converted data).
  *         Caution: Offset format is dependent to ADC resolution:
  *         offset has to be left-aligned on bit 11, the LSB (right bits)
  *         are set to 0.
  * @note   Offset cannot be enabled or disabled.
  *         To emulate offset disabled, set an offset value equal to 0.
  * @param  ADCx ADC instance
  * @param  Rank This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_RANK_1
  *         @arg @ref DDL_ADC_INJ_RANK_2
  *         @arg @ref DDL_ADC_INJ_RANK_3
  *         @arg @ref DDL_ADC_INJ_RANK_4
  * @param  OffsetLevel Value between Min_Data=0x000 and Max_Data=0xFFF
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_INJ_SetOffset(ADC_TypeDef *ADCx, uint32_t Rank, uint32_t OffsetLevel)
{
  __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->INJDOF1, __ADC_MASK_SHIFT(Rank, ADC_INJ_JOFRX_REGOFFSET_MASK));

  MODIFY_REG(*preg,
             ADC_INJDOF1_INJDOF1,
             OffsetLevel);
}

/**
  * @brief  Get ADC group injected offset.
  * @note   It gives offset level (offset to be subtracted from the raw converted data).
  *         Caution: Offset format is dependent to ADC resolution:
  *         offset has to be left-aligned on bit 11, the LSB (right bits)
  *         are set to 0.
  * @param  ADCx ADC instance
  * @param  Rank This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_INJ_RANK_1
  *         @arg @ref DDL_ADC_INJ_RANK_2
  *         @arg @ref DDL_ADC_INJ_RANK_3
  *         @arg @ref DDL_ADC_INJ_RANK_4
  * @retval Value between Min_Data=0x000 and Max_Data=0xFFF
  */
__STATIC_INLINE uint32_t DDL_ADC_INJ_GetOffset(ADC_TypeDef *ADCx, uint32_t Rank)
{
  __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->INJDOF1, __ADC_MASK_SHIFT(Rank, ADC_INJ_JOFRX_REGOFFSET_MASK));

  return (uint32_t)(READ_BIT(*preg,
                             ADC_INJDOF1_INJDOF1)
                   );
}

/**
  * @}
  */

/** @defgroup ADC_DDL_EF_Configuration_Channels Configuration of ADC hierarchical scope: channels
  * @{
  */

/**
  * @brief  Set sampling time of the selected ADC channel
  *         Unit: ADC clock cycles.
  * @note   On this device, sampling time is on channel scope: independently
  *         of channel mapped on ADC group regular or injected.
  * @note   In case of internal channel (VrefInt, TempSensor, ...) to be
  *         converted:
  *         sampling time constraints must be respected (sampling time can be
  *         adjusted in function of ADC clock frequency and sampling time
  *         setting).
  *         Refer to device datasheet for timings values (parameters TS_vrefint,
  *         TS_temp, ...).
  * @note   Conversion time is the addition of sampling time and processing time.
  *         Refer to reference manual for ADC processing time of
  *         this APM32 series.
  * @note   In case of ADC conversion of internal channel (VrefInt,
  *         temperature sensor, ...), a sampling time minimum value
  *         is required.
  *         Refer to device datasheet.
  * @param  ADCx ADC instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_CHANNEL_0
  *         @arg @ref DDL_ADC_CHANNEL_1
  *         @arg @ref DDL_ADC_CHANNEL_2
  *         @arg @ref DDL_ADC_CHANNEL_3
  *         @arg @ref DDL_ADC_CHANNEL_4
  *         @arg @ref DDL_ADC_CHANNEL_5
  *         @arg @ref DDL_ADC_CHANNEL_6
  *         @arg @ref DDL_ADC_CHANNEL_7
  *         @arg @ref DDL_ADC_CHANNEL_8
  *         @arg @ref DDL_ADC_CHANNEL_9
  *         @arg @ref DDL_ADC_CHANNEL_10
  *         @arg @ref DDL_ADC_CHANNEL_11
  *         @arg @ref DDL_ADC_CHANNEL_12
  *         @arg @ref DDL_ADC_CHANNEL_13
  *         @arg @ref DDL_ADC_CHANNEL_14
  *         @arg @ref DDL_ADC_CHANNEL_15
  *         @arg @ref DDL_ADC_CHANNEL_16
  *         @arg @ref DDL_ADC_CHANNEL_17
  *         @arg @ref DDL_ADC_CHANNEL_18
  *         @arg @ref DDL_ADC_CHANNEL_VREFINT      (1)
  *         @arg @ref DDL_ADC_CHANNEL_TEMPSENSOR   (1)(2)
  *         @arg @ref DDL_ADC_CHANNEL_VBAT         (1)
  *
  *         (1) On APM32F4, parameter available only on ADC instance: ADC1.\n
  * @param  SamplingTime
  *         ON APM32F4(not APM32F402/403xx), This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_SAMPLINGTIME_3CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_15CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_28CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_56CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_84CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_112CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_144CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_480CYCLES
  *         ON APM32F402/403xx, This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_SAMPLINGTIME_1CYCLE_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_7CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_13CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_28CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_41CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_55CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_71CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_239CYCLES_5
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_SetChannelSamplingTime(ADC_TypeDef *ADCx, uint32_t Channel, uint32_t SamplingTime)
{
  /* Set bits with content of parameter "SamplingTime" with bits position     */
  /* in register and register position depending on parameter "Channel".      */
  /* Parameter "Channel" is used with masks because containing                */
  /* other bits reserved for other purpose.                                   */
  __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->SMPTIM1, __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPRX_REGOFFSET_MASK));

  MODIFY_REG(*preg,
             ADC_SMPTIM2_SMPCYCCFG0 << __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPx_BITOFFSET_MASK),
             SamplingTime   << __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPx_BITOFFSET_MASK));
}

/**
  * @brief  Get sampling time of the selected ADC channel
  *         Unit: ADC clock cycles.
  * @note   On this device, sampling time is on channel scope: independently
  *         of channel mapped on ADC group regular or injected.
  * @note   Conversion time is the addition of sampling time and processing time.
  *         Refer to reference manual for ADC processing time of
  *         this APM32 series.
  * @param  ADCx ADC instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_CHANNEL_0
  *         @arg @ref DDL_ADC_CHANNEL_1
  *         @arg @ref DDL_ADC_CHANNEL_2
  *         @arg @ref DDL_ADC_CHANNEL_3
  *         @arg @ref DDL_ADC_CHANNEL_4
  *         @arg @ref DDL_ADC_CHANNEL_5
  *         @arg @ref DDL_ADC_CHANNEL_6
  *         @arg @ref DDL_ADC_CHANNEL_7
  *         @arg @ref DDL_ADC_CHANNEL_8
  *         @arg @ref DDL_ADC_CHANNEL_9
  *         @arg @ref DDL_ADC_CHANNEL_10
  *         @arg @ref DDL_ADC_CHANNEL_11
  *         @arg @ref DDL_ADC_CHANNEL_12
  *         @arg @ref DDL_ADC_CHANNEL_13
  *         @arg @ref DDL_ADC_CHANNEL_14
  *         @arg @ref DDL_ADC_CHANNEL_15
  *         @arg @ref DDL_ADC_CHANNEL_16
  *         @arg @ref DDL_ADC_CHANNEL_17
  *         @arg @ref DDL_ADC_CHANNEL_18
  *         @arg @ref DDL_ADC_CHANNEL_VREFINT      (1)
  *         @arg @ref DDL_ADC_CHANNEL_TEMPSENSOR   (1)(2)
  *         @arg @ref DDL_ADC_CHANNEL_VBAT         (1)
  *
  *         (1) On APM32F4, parameter available only on ADC instance: ADC1.\n
  * @retval On APM32F4(not APM32F402/403xx), returned value can be one of the following values:
  *         @arg @ref DDL_ADC_SAMPLINGTIME_3CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_15CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_28CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_56CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_84CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_112CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_144CYCLES
  *         @arg @ref DDL_ADC_SAMPLINGTIME_480CYCLES
  *         On APM32F402/403xx, returned value can be one of the following values:
  *         @arg @ref DDL_ADC_SAMPLINGTIME_1CYCLE_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_7CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_13CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_28CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_41CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_55CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_71CYCLES_5
  *         @arg @ref DDL_ADC_SAMPLINGTIME_239CYCLES_5
  */
__STATIC_INLINE uint32_t DDL_ADC_GetChannelSamplingTime(ADC_TypeDef *ADCx, uint32_t Channel)
{
  __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->SMPTIM1, __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPRX_REGOFFSET_MASK));

  return (uint32_t)(READ_BIT(*preg,
                             ADC_SMPTIM2_SMPCYCCFG0 << __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPx_BITOFFSET_MASK))
                    >> __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPx_BITOFFSET_MASK)
                   );
}

/**
  * @}
  */

