betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_adc.h
/** @defgroup ADC_DDL_EF_Configuration_ADC_AnalogWatchdog Configuration of ADC transversal scope: analog watchdog
  * @{
  */

/**
  * @brief  Set ADC analog watchdog monitored channels:
  *         a single channel or all channels,
  *         on ADC groups regular and-or injected.
  * @note   Once monitored channels are selected, analog watchdog
  *         is enabled.
  * @note   In case of need to define a single channel to monitor
  *         with analog watchdog from sequencer channel definition,
  *         use helper macro @ref __DDL_ADC_ANALOGWD_CHANNEL_GROUP().
  * @note   On this APM32 series, there is only 1 kind of analog watchdog
  *         instance:
  *         - AWD standard (instance AWD1):
  *           - channels monitored: can monitor 1 channel or all channels.
  *           - groups monitored: ADC groups regular and-or injected.
  *           - resolution: resolution is not limited (corresponds to
  *             ADC resolution configured).
  * @param  ADCx ADC instance
  * @param  AWDChannelGroup This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_AWD_DISABLE
  *         @arg @ref DDL_ADC_AWD_ALL_CHANNELS_REG
  *         @arg @ref DDL_ADC_AWD_ALL_CHANNELS_INJ
  *         @arg @ref DDL_ADC_AWD_ALL_CHANNELS_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_0_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_0_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_0_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_1_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_1_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_1_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_2_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_2_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_2_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_3_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_3_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_3_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_4_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_4_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_4_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_5_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_5_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_5_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_6_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_6_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_6_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_7_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_7_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_7_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_8_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_8_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_8_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_9_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_9_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_9_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_10_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_10_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_10_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_11_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_11_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_11_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_12_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_12_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_12_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_13_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_13_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_13_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_14_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_14_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_14_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_15_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_15_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_15_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_16_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_16_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_16_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_17_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_17_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_17_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_18_REG          (3)
  *         @arg @ref DDL_ADC_AWD_CHANNEL_18_INJ          (3)
  *         @arg @ref DDL_ADC_AWD_CHANNEL_18_REG_INJ      (3)
  *         @arg @ref DDL_ADC_AWD_CH_VREFINT_REG          (1)
  *         @arg @ref DDL_ADC_AWD_CH_VREFINT_INJ          (1)
  *         @arg @ref DDL_ADC_AWD_CH_VREFINT_REG_INJ      (1)
  *         @arg @ref DDL_ADC_AWD_CH_TEMPSENSOR_REG       (1)(2)
  *         @arg @ref DDL_ADC_AWD_CH_TEMPSENSOR_INJ       (1)(2)
  *         @arg @ref DDL_ADC_AWD_CH_TEMPSENSOR_REG_INJ   (1)(2)
  *         @arg @ref DDL_ADC_AWD_CH_VBAT_REG             (1)(3)
  *         @arg @ref DDL_ADC_AWD_CH_VBAT_INJ             (1)(3)
  *         @arg @ref DDL_ADC_AWD_CH_VBAT_REG_INJ         (1)(3)
  *
  *         (1) On APM32F4, parameter available only on ADC instance: ADC1.\n
  *         (3) This parameter is not available for APM32F402/403xx.\n
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_SetAnalogWDMonitChannels(ADC_TypeDef *ADCx, uint32_t AWDChannelGroup)
{
  MODIFY_REG(ADCx->CTRL1,
             (ADC_CTRL1_REGAWDEN | ADC_CTRL1_INJAWDEN | ADC_CTRL1_AWDSGLEN | ADC_CTRL1_AWDCHSEL),
             AWDChannelGroup);
}

/**
  * @brief  Get ADC analog watchdog monitored channel.
  * @note   Usage of the returned channel number:
  *         - To reinject this channel into another function DDL_ADC_xxx:
  *           the returned channel number is only partly formatted on definition
  *           of literals DDL_ADC_CHANNEL_x. Therefore, it has to be compared
  *           with parts of literals DDL_ADC_CHANNEL_x or using
  *           helper macro @ref __DDL_ADC_CHANNEL_TO_DECIMAL_NB().
  *           Then the selected literal DDL_ADC_CHANNEL_x can be used
  *           as parameter for another function.
  *         - To get the channel number in decimal format:
  *           process the returned value with the helper macro
  *           @ref __DDL_ADC_CHANNEL_TO_DECIMAL_NB().
  *           Applicable only when the analog watchdog is set to monitor
  *           one channel.
  * @note   On this APM32 series, there is only 1 kind of analog watchdog
  *         instance:
  *         - AWD standard (instance AWD1):
  *           - channels monitored: can monitor 1 channel or all channels.
  *           - groups monitored: ADC groups regular and-or injected.
  *           - resolution: resolution is not limited (corresponds to
  *             ADC resolution configured).
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_AWD_DISABLE
  *         @arg @ref DDL_ADC_AWD_ALL_CHANNELS_REG
  *         @arg @ref DDL_ADC_AWD_ALL_CHANNELS_INJ
  *         @arg @ref DDL_ADC_AWD_ALL_CHANNELS_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_0_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_0_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_0_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_1_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_1_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_1_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_2_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_2_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_2_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_3_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_3_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_3_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_4_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_4_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_4_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_5_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_5_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_5_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_6_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_6_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_6_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_7_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_7_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_7_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_8_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_8_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_8_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_9_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_9_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_9_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_10_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_10_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_10_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_11_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_11_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_11_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_12_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_12_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_12_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_13_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_13_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_13_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_14_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_14_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_14_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_15_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_15_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_15_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_16_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_16_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_16_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_17_REG
  *         @arg @ref DDL_ADC_AWD_CHANNEL_17_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_17_REG_INJ
  *         @arg @ref DDL_ADC_AWD_CHANNEL_18_REG       (1)
  *         @arg @ref DDL_ADC_AWD_CHANNEL_18_INJ       (1)
  *         @arg @ref DDL_ADC_AWD_CHANNEL_18_REG_INJ   (1)
  *
  *         (1) This parameter is not available for APM32F402/403xx.\n
  */
__STATIC_INLINE uint32_t DDL_ADC_GetAnalogWDMonitChannels(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CTRL1, (ADC_CTRL1_REGAWDEN | ADC_CTRL1_INJAWDEN | ADC_CTRL1_AWDSGLEN | ADC_CTRL1_AWDCHSEL)));
}

/**
  * @brief  Set ADC analog watchdog threshold value of threshold
  *         high or low.
  * @note   In case of ADC resolution different of 12 bits,
  *         analog watchdog thresholds data require a specific shift.
  *         Use helper macro @ref __DDL_ADC_ANALOGWD_SET_THRESHOLD_RESOLUTION().
  * @note   On this APM32 series, there is only 1 kind of analog watchdog
  *         instance:
  *         - AWD standard (instance AWD1):
  *           - channels monitored: can monitor 1 channel or all channels.
  *           - groups monitored: ADC groups regular and-or injected.
  *           - resolution: resolution is not limited (corresponds to
  *             ADC resolution configured).
  * @param  ADCx ADC instance
  * @param  AWDThresholdsHighLow This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_AWD_THRESHOLD_HIGH
  *         @arg @ref DDL_ADC_AWD_THRESHOLD_LOW
  * @param  AWDThresholdValue Value between Min_Data=0x000 and Max_Data=0xFFF
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_SetAnalogWDThresholds(ADC_TypeDef *ADCx, uint32_t AWDThresholdsHighLow, uint32_t AWDThresholdValue)
{
  __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->AWDHT, AWDThresholdsHighLow);

  MODIFY_REG(*preg,
             ADC_AWDHT_AWDHT,
             AWDThresholdValue);
}

/**
  * @brief  Get ADC analog watchdog threshold value of threshold high or
  *         threshold low.
  * @note   In case of ADC resolution different of 12 bits,
  *         analog watchdog thresholds data require a specific shift.
  *         Use helper macro @ref __DDL_ADC_ANALOGWD_GET_THRESHOLD_RESOLUTION().
  * @param  ADCx ADC instance
  * @param  AWDThresholdsHighLow This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_AWD_THRESHOLD_HIGH
  *         @arg @ref DDL_ADC_AWD_THRESHOLD_LOW
  * @retval Value between Min_Data=0x000 and Max_Data=0xFFF
*/
__STATIC_INLINE uint32_t DDL_ADC_GetAnalogWDThresholds(ADC_TypeDef *ADCx, uint32_t AWDThresholdsHighLow)
{
  __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->AWDHT, AWDThresholdsHighLow);

  return (uint32_t)(READ_BIT(*preg, ADC_AWDHT_AWDHT));
}

/**
  * @}
  */

