betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_adc.h
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @defgroup ADC_DDL_EF_Configuration_ADC_Oversampling Configuration on ADC transversal scope: oversampling
  * @{
  */

/**
  * @brief  Enable ADC oversampling on the selected ADC instance.
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_EnableOverSampling(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->OSAMPCTRL, ADC_OSAMPCTRL_OSEN);
}

/**
  * @brief  Disable ADC oversampling on the selected ADC instance.
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_DisableOverSampling(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->OSAMPCTRL, ADC_OSAMPCTRL_OSEN);
}

/**
 * @brief  Set ADC oversampling discontinuous mode (triggered mode)
 *         on the selected ADC group.
 * @note   Number of oversampled conversions are done either in:
 *         - continuous mode (all conversions of oversampling are
 *           done from 1 trigger)
 *         - discontinuous mode (each conversion of oversampling
 *           needs a trigger)
 * @param  ADCx ADC instance
 * @param  OverSamplingDiscont This parameter can be one of the following values:
 *         @arg @ref DDL_ADC_OVS_REG_CONT
 *         @arg @ref DDL_ADC_OVS_REG_DISCONT
 * @retval None
 */
__STATIC_INLINE void DDL_ADC_SetOverSamplingDiscont(ADC_TypeDef *ADCx, uint32_t OverSamplingDiscont)
{
  MODIFY_REG(ADCx->OSAMPCTRL, ADC_OSAMPCTRL_TOS, OverSamplingDiscont);
}

/**
  * @brief  Get ADC oversampling discontinuous mode (triggered mode)
  *         on the selected ADC group.
 *  @note   Number of oversampled conversions are done either in:
 *         - continuous mode (all conversions of oversampling are
 *           done from 1 trigger)
 *         - discontinuous mode (each conversion of oversampling
 *           needs a trigger)
 * @param  ADCx ADC instance
 * @retval Returned value can be one of the following values:
 *         @arg @ref DDL_ADC_OVS_REG_CONT
 *         @arg @ref DDL_ADC_OVS_REG_DISCONT
 */
__STATIC_INLINE uint32_t DDL_ADC_GetOverSamplingDiscont(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->OSAMPCTRL, ADC_OSAMPCTRL_TOS));
}

/**
  * @brief  Set ADC oversampling
  * @note   This function set the 2 items of oversampling configuration:
  *         - ratio
  *         - shift
  * @param  ADCx ADC instance
  * @param  Ratio This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_OVS_RATIO_2
  *         @arg @ref DDL_ADC_OVS_RATIO_4
  *         @arg @ref DDL_ADC_OVS_RATIO_8
  *         @arg @ref DDL_ADC_OVS_RATIO_16
  *         @arg @ref DDL_ADC_OVS_RATIO_32
  *         @arg @ref DDL_ADC_OVS_RATIO_64
  *         @arg @ref DDL_ADC_OVS_RATIO_128
  *         @arg @ref DDL_ADC_OVS_RATIO_256
  * @param  Shift This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_OVS_SHIFT_NONE
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_1
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_2
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_3
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_4
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_5
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_6
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_7
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_8
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_ConfigOverSamplingRatioShift(ADC_TypeDef *ADCx, uint32_t Ratio, uint32_t Shift)
{
  MODIFY_REG(ADCx->OSAMPCTRL, (ADC_OSAMPCTRL_OSR | ADC_OSAMPCTRL_OSS), (Ratio | Shift));
}

/**
  * @brief  Get ADC oversampling ratio
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_OVS_RATIO_2
  *         @arg @ref DDL_ADC_OVS_RATIO_4
  *         @arg @ref DDL_ADC_OVS_RATIO_8
  *         @arg @ref DDL_ADC_OVS_RATIO_16
  *         @arg @ref DDL_ADC_OVS_RATIO_32
  *         @arg @ref DDL_ADC_OVS_RATIO_64
  *         @arg @ref DDL_ADC_OVS_RATIO_128
  *         @arg @ref DDL_ADC_OVS_RATIO_256
*/
__STATIC_INLINE uint32_t DDL_ADC_GetOverSamplingRatio(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->OSAMPCTRL, ADC_OSAMPCTRL_OSR));
}

/**
  * @brief  Get ADC oversampling shift
  * @param  ADCx ADC instance
  * @retval Shift This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_OVS_SHIFT_NONE
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_1
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_2
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_3
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_4
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_5
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_6
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_7
  *         @arg @ref DDL_ADC_OVS_SHIFT_RIGHT_8
*/
__STATIC_INLINE uint32_t DDL_ADC_GetOverSamplingShift(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->OSAMPCTRL, ADC_OSAMPCTRL_OSS));
}

/**
  * @}
  */
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

/** @defgroup ADC_DDL_EF_Configuration_ADC_Multimode Configuration of ADC hierarchical scope: multimode
  * @{
  */

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  Set ADC multimode configuration to operate in independent mode
  *         or multimode (for devices with several ADC instances).
  * @note   If multimode configuration: the selected ADC instance is
  *         either master or slave depending on hardware.
  *         Refer to reference manual.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @param  Multimode This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_MULTI_INDEPENDENT
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_SIMULT
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INTERL            (2)
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INTERL_FAST       (1)
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INTERL_SLOW       (1)
  *         @arg @ref DDL_ADC_MULTI_DUAL_INJ_SIMULT
  *         @arg @ref DDL_ADC_MULTI_DUAL_INJ_ALTERN
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_SIM_INJ_SIM
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_SIM_INJ_ALT
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INT_INJ_SIM       (2)
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INTFAST_INJ_SIM   (1)
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INTSLOW_INJ_SIM   (1)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_REG_SIM_INJ_SIM     (2)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_REG_SIM_INJ_ALT     (2)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_INJ_SIMULT          (2)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_REG_SIMULT          (2)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_REG_INTERL          (2)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_INJ_ALTERN          (2)
  *         (1) This parameter is only for APM32F402/403xx.
  *         (2) This parameter is not available for APM32F402/403xx.
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_SetMultimode(ADC_Common_TypeDef *ADCxy_COMMON, uint32_t Multimode)
{
#if defined (ADC_CCTRL_ADCMSEL)
  MODIFY_REG(ADCxy_COMMON->CCTRL, ADC_CCTRL_ADCMSEL, Multimode);
#else
  MODIFY_REG(ADCxy_COMMON->CTRL1, ADC_CTRL1_DUALMCFG, Multimode);
#endif /* ADC_CCTRL_ADCMSEL */
}

/**
  * @brief  Get ADC multimode configuration to operate in independent mode
  *         or multimode (for devices with several ADC instances).
  * @note   If multimode configuration: the selected ADC instance is
  *         either master or slave depending on hardware.
  *         Refer to reference manual.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_MULTI_INDEPENDENT
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_SIMULT
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INTERL            (2)
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INTERL_FAST       (1)
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INTERL_SLOW       (1)
  *         @arg @ref DDL_ADC_MULTI_DUAL_INJ_SIMULT
  *         @arg @ref DDL_ADC_MULTI_DUAL_INJ_ALTERN
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_SIM_INJ_SIM
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_SIM_INJ_ALT
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INT_INJ_SIM       (2)
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INTFAST_INJ_SIM   (1)
  *         @arg @ref DDL_ADC_MULTI_DUAL_REG_INTSLOW_INJ_SIM   (1)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_REG_SIM_INJ_SIM     (2)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_REG_SIM_INJ_ALT     (2)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_INJ_SIMULT          (2)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_REG_SIMULT          (2)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_REG_INTERL          (2)
  *         @arg @ref DDL_ADC_MULTI_TRIPLE_INJ_ALTERN          (2)
  *         (1) This parameter is only for APM32F402/403xx.
  *         (2) This parameter is not available for APM32F402/403xx.
  */
__STATIC_INLINE uint32_t DDL_ADC_GetMultimode(ADC_Common_TypeDef *ADCxy_COMMON)
{
#if defined (ADC_CCTRL_ADCMSEL)
  return (uint32_t)(READ_BIT(ADCxy_COMMON->CCTRL, ADC_CCTRL_ADCMSEL));
#else
  return (uint32_t)(READ_BIT(ADCxy_COMMON->CTRL1, ADC_CTRL1_DUALMCFG));
#endif /* ADC_CCTRL_ADCMSEL */
}

#if defined (ADC_CCTRL_DMAMODE)
/**
  * @brief  Set ADC multimode conversion data transfer: no transfer
  *         or transfer by DMA.
  * @note   If ADC multimode transfer by DMA is not selected:
  *         each ADC uses its own DMA channel, with its individual
  *         DMA transfer settings.
  *         If ADC multimode transfer by DMA is selected:
  *         One DMA channel is used for both ADC (DMA of ADC master)
  *         Specifies the DMA requests mode:
  *         - Limited mode (One shot mode): DMA transfer requests are stopped
  *           when number of DMA data transfers (number of
  *           ADC conversions) is reached.
  *           This ADC mode is intended to be used with DMA mode non-circular.
  *         - Unlimited mode: DMA transfer requests are unlimited,
  *           whatever number of DMA data transfers (number of
  *           ADC conversions).
  *           This ADC mode is intended to be used with DMA mode circular.
  * @note   If ADC DMA requests mode is set to unlimited and DMA is set to
  *         mode non-circular:
  *         when DMA transfers size will be reached, DMA will stop transfers of
  *         ADC conversions data ADC will raise an overrun error
  *         (overrun flag and interruption if enabled).
  * @note   How to retrieve multimode conversion data:
  *         Whatever multimode transfer by DMA setting: using function
  *         @ref DDL_ADC_REG_ReadMultiConversionData32().
  *         If ADC multimode transfer by DMA is selected: conversion data
  *         is a raw data with ADC master and slave concatenated.
  *         A macro is available to get the conversion data of
  *         ADC master or ADC slave: see helper macro
  *         @ref __DDL_ADC_MULTI_CONV_DATA_MASTER_SLAVE().
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @param  MultiDMATransfer This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_EACH_ADC
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_LIMIT_1
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_LIMIT_2
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_LIMIT_3
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_UNLMT_1
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_UNLMT_2
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_UNLMT_3
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_SetMultiDMATransfer(ADC_Common_TypeDef *ADCxy_COMMON, uint32_t MultiDMATransfer)
{
  MODIFY_REG(ADCxy_COMMON->CCTRL, ADC_CCTRL_DMAMODE | ADC_CCTRL_DMAMODEDISSEL, MultiDMATransfer);
}

/**
  * @brief  Get ADC multimode conversion data transfer: no transfer
  *         or transfer by DMA.
  * @note   If ADC multimode transfer by DMA is not selected:
  *         each ADC uses its own DMA channel, with its individual
  *         DMA transfer settings.
  *         If ADC multimode transfer by DMA is selected:
  *         One DMA channel is used for both ADC (DMA of ADC master)
  *         Specifies the DMA requests mode:
  *         - Limited mode (One shot mode): DMA transfer requests are stopped
  *           when number of DMA data transfers (number of
  *           ADC conversions) is reached.
  *           This ADC mode is intended to be used with DMA mode non-circular.
  *         - Unlimited mode: DMA transfer requests are unlimited,
  *           whatever number of DMA data transfers (number of
  *           ADC conversions).
  *           This ADC mode is intended to be used with DMA mode circular.
  * @note   If ADC DMA requests mode is set to unlimited and DMA is set to
  *         mode non-circular:
  *         when DMA transfers size will be reached, DMA will stop transfers of
  *         ADC conversions data ADC will raise an overrun error
  *         (overrun flag and interruption if enabled).
  * @note   How to retrieve multimode conversion data:
  *         Whatever multimode transfer by DMA setting: using function
  *         @ref DDL_ADC_REG_ReadMultiConversionData32().
  *         If ADC multimode transfer by DMA is selected: conversion data
  *         is a raw data with ADC master and slave concatenated.
  *         A macro is available to get the conversion data of
  *         ADC master or ADC slave: see helper macro
  *         @ref __DDL_ADC_MULTI_CONV_DATA_MASTER_SLAVE().
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_EACH_ADC
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_LIMIT_1
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_LIMIT_2
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_LIMIT_3
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_UNLMT_1
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_UNLMT_2
  *         @arg @ref DDL_ADC_MULTI_REG_DMA_UNLMT_3
  */
__STATIC_INLINE uint32_t DDL_ADC_GetMultiDMATransfer(ADC_Common_TypeDef *ADCxy_COMMON)
{
  return (uint32_t)(READ_BIT(ADCxy_COMMON->CCTRL, ADC_CCTRL_DMAMODE | ADC_CCTRL_DMAMODEDISSEL));
}
#endif /* ADC_CCTRL_DMAMODE */

#if defined (ADC_CCTRL_SMPDEL2)
/**
  * @brief  Set ADC multimode delay between 2 sampling phases.
  * @note   The sampling delay range depends on ADC resolution:
  *         - ADC resolution 12 bits can have maximum delay of 12 cycles.
  *         - ADC resolution 10 bits can have maximum delay of 10 cycles.
  *         - ADC resolution  8 bits can have maximum delay of  8 cycles.
  *         - ADC resolution  6 bits can have maximum delay of  6 cycles.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @param  MultiTwoSamplingDelay This parameter can be one of the following values:
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_5CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_6CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_7CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_8CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_9CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_10CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_11CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_12CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_13CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_14CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_15CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_16CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_17CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_18CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_19CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_20CYCLES
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_SetMultiTwoSamplingDelay(ADC_Common_TypeDef *ADCxy_COMMON, uint32_t MultiTwoSamplingDelay)
{
  MODIFY_REG(ADCxy_COMMON->CCTRL, ADC_CCTRL_SMPDEL2, MultiTwoSamplingDelay);
}

/**
  * @brief  Get ADC multimode delay between 2 sampling phases.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_5CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_6CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_7CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_8CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_9CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_10CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_11CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_12CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_13CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_14CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_15CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_16CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_17CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_18CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_19CYCLES
  *         @arg @ref DDL_ADC_MULTI_TWOSMP_DELAY_20CYCLES
  */
__STATIC_INLINE uint32_t DDL_ADC_GetMultiTwoSamplingDelay(ADC_Common_TypeDef *ADCxy_COMMON)
{
  return (uint32_t)(READ_BIT(ADCxy_COMMON->CCTRL, ADC_CCTRL_SMPDEL2));
}
#endif /* ADC_CCTRL_SMPDEL2 */
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @}
  */
/** @defgroup ADC_DDL_EF_Operation_ADC_Instance Operation on ADC hierarchical scope: ADC instance
  * @{
  */

/**
  * @brief  Enable the selected ADC instance.
  * @note   On this APM32 series, after ADC enable, a delay for
  *         ADC internal analog stabilization is required before performing a
  *         ADC conversion start.
  *         Refer to device datasheet, parameter tSTAB.
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_Enable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CTRL2, ADC_CTRL2_ADCEN);
}

/**
  * @brief  Disable the selected ADC instance.
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_Disable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CTRL2, ADC_CTRL2_ADCEN);
}

/**
  * @brief  Get the selected ADC instance enable state.
  * @param  ADCx ADC instance
  * @retval 0: ADC is disabled, 1: ADC is enabled.
  */
__STATIC_INLINE uint32_t DDL_ADC_IsEnabled(ADC_TypeDef *ADCx)
{
  return (READ_BIT(ADCx->CTRL2, ADC_CTRL2_ADCEN) == (ADC_CTRL2_ADCEN));
}

#if defined (ADC_CTRL2_CAL)
/**
  * @brief  Start ADC calibration in the mode single-ended
  *         or differential (for devices with differential mode available).
  * @note   On this APM32 serie, before starting a calibration,
  *         ADC must be disabled.
  *         A minimum number of ADC clock cycles are required
  *         between ADC disable state and calibration start.
  *         Refer to literal @ref DDL_ADC_DELAY_DISABLE_CALIB_ADC_CYCLES.
  * @note   On this APM32 serie, hardware prerequisite before starting a calibration:
            the ADC must have been in power-on state for at least
            two ADC clock cycles.
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void DDL_ADC_StartCalibration(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CTRL2, ADC_CTRL2_CAL);
}

/**
  * @brief  Get ADC calibration state.
  * @param  ADCx ADC instance
  * @retval 0: calibration complete, 1: calibration in progress.
  */
__STATIC_INLINE uint32_t DDL_ADC_IsCalibrationOnGoing(ADC_TypeDef *ADCx)
{
  return (READ_BIT(ADCx->CTRL2, ADC_CTRL2_CAL) == (ADC_CTRL2_CAL));
}
#endif /* ADC_CTRL2_CAL */

/**
  * @}
  */

