betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_adc.h
#if defined (DDL_ADC_FLAG_EOS_SLV)
/**
  * @brief  Get flag multimode ADC group regular end of sequence conversions of the ADC slave.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_ADC_IsActiveFlag_SLV_EOS(ADC_Common_TypeDef *ADCxy_COMMON)
{
  register __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCxy_COMMON->STS, 1U);

  return (READ_BIT(*preg, DDL_ADC_FLAG_EOS_SLV) == (DDL_ADC_FLAG_EOS_SLV));
}
#endif /* DDL_ADC_FLAG_EOS_SLV */

#if defined (DDL_ADC_FLAG_EOCS_SLV1)
/**
  * @brief  Get flag multimode ADC group regular end of unitary conversion
  *         or end of sequence conversions, depending on
  *         ADC configuration, of the ADC slave 1.
  * @note   To configure flag of end of conversion,
  *         use function @ref DDL_ADC_REG_SetFlagEndOfConversion().
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_ADC_IsActiveFlag_SLV1_EOCS(ADC_Common_TypeDef *ADCxy_COMMON)
{
  return (READ_BIT(ADCxy_COMMON->CSTS, DDL_ADC_FLAG_EOCS_SLV1) == (DDL_ADC_FLAG_EOCS_SLV1));
}
#endif /* DDL_ADC_FLAG_EOCS_SLV1 */

#if defined (DDL_ADC_FLAG_EOCS_SLV2)
/**
  * @brief  Get flag multimode ADC group regular end of unitary conversion
  *         or end of sequence conversions, depending on
  *         ADC configuration, of the ADC slave 2.
  * @note   To configure flag of end of conversion,
  *         use function @ref DDL_ADC_REG_SetFlagEndOfConversion().
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_ADC_IsActiveFlag_SLV2_EOCS(ADC_Common_TypeDef *ADCxy_COMMON)
{
  return (READ_BIT(ADCxy_COMMON->CSTS, DDL_ADC_FLAG_EOCS_SLV2) == (DDL_ADC_FLAG_EOCS_SLV2));
}
#endif /* DDL_ADC_FLAG_EOCS_SLV2 */

#if defined (DDL_ADC_FLAG_OVR_MST)
/**
  * @brief  Get flag multimode ADC group regular overrun of the ADC master.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_ADC_IsActiveFlag_MST_OVR(ADC_Common_TypeDef *ADCxy_COMMON)
{
  return (READ_BIT(ADCxy_COMMON->CSTS, DDL_ADC_FLAG_OVR_MST) == (DDL_ADC_FLAG_OVR_MST));
}
#endif /* DDL_ADC_FLAG_OVR_MST */

#if defined (DDL_ADC_FLAG_OVR_SLV1)
/**
  * @brief  Get flag multimode ADC group regular overrun of the ADC slave 1.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_ADC_IsActiveFlag_SLV1_OVR(ADC_Common_TypeDef *ADCxy_COMMON)
{
  return (READ_BIT(ADCxy_COMMON->CSTS, DDL_ADC_FLAG_OVR_SLV1) == (DDL_ADC_FLAG_OVR_SLV1));
}
#endif /* DDL_ADC_FLAG_OVR_SLV1 */

#if defined (DDL_ADC_FLAG_OVR_SLV2)
/**
  * @brief  Get flag multimode ADC group regular overrun of the ADC slave 2.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_ADC_IsActiveFlag_SLV2_OVR(ADC_Common_TypeDef *ADCxy_COMMON)
{
  return (READ_BIT(ADCxy_COMMON->CSTS, DDL_ADC_FLAG_OVR_SLV2) == (DDL_ADC_FLAG_OVR_SLV2));
}
#endif /* DDL_ADC_FLAG_OVR_SLV2 */

/**
  * @brief  Get flag multimode ADC group injected end of sequence conversions of the ADC master.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_ADC_IsActiveFlag_MST_JEOS(ADC_Common_TypeDef *ADCxy_COMMON)
{
  /* Note: on this APM32 series, there is no flag ADC group injected          */
  /*       end of unitary conversion.                                         */
  /*       Flag noted as "JEOC" is corresponding to flag "JEOS"               */
  /*       in other APM32 families).                                          */
#if defined (ADC_CSTS_INJEOCFLG1)
  return (READ_BIT(ADCxy_COMMON->CSTS, ADC_CSTS_INJEOCFLG1) == (ADC_CSTS_INJEOCFLG1));
#else
  return (READ_BIT(ADCxy_COMMON->STS, ADC_STS_INJEOCFLG) == (ADC_STS_INJEOCFLG));
#endif /* ADC_CSTS_INJEOCFLG1 */
}

#if defined (DDL_ADC_FLAG_JEOS_SLV)
/**
  * @brief  Get flag multimode ADC group injected end of sequence conversions of the ADC slave.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_ADC_IsActiveFlag_SLV_JEOS(ADC_Common_TypeDef *ADCxy_COMMON)
{
  /* Note: on this APM32 serie, there is no flag ADC group injected          */
  /*       end of unitary conversion.                                         */
  /*       Flag noted as "JEOC" is corresponding to flag "JEOS"               */
  /*       in other APM32 families).                                          */

  register __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCxy_COMMON->STS, 1U);

  return (READ_BIT(*preg, DDL_ADC_FLAG_JEOS_SLV) == (DDL_ADC_FLAG_JEOS_SLV));
}
#endif /* DDL_ADC_FLAG_JEOS_SLV */

#if defined (DDL_ADC_FLAG_JEOS_SLV1)
/**
  * @brief  Get flag multimode ADC group injected end of sequence conversions of the ADC slave 1.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_ADC_IsActiveFlag_SLV1_JEOS(ADC_Common_TypeDef *ADCxy_COMMON)
{
  /* Note: on this APM32 series, there is no flag ADC group injected          */
  /*       end of unitary conversion.                                         */
  /*       Flag noted as "JEOC" is corresponding to flag "JEOS"               */
  /*       in other APM32 families).                                          */
  return (READ_BIT(ADCxy_COMMON->CSTS, DDL_ADC_FLAG_JEOS_SLV1) == (DDL_ADC_FLAG_JEOS_SLV1));
}
#endif /* DDL_ADC_FLAG_JEOS_SLV1 */

